Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xada (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x59b0f): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m33 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv8-m.main+dsp+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x87bc6): ../Core/Src/BoardSupportPackage/BSP_IOBus.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x1091c4): C:/Users/evanl/OneDrive/Documents/Embedded_Software_Workspaces/ExampleCode/SurveillanceSystem/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x115941): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0xaf3ef): __uint8_t
    <35>   DW_AT_decl_file   : 2
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)
    <3f>   DW_AT_name        : (indirect string, offset: 0x7d2c4): unsigned char
 <1><43>: Abbrev Number: 2 (DW_TAG_base_type)
    <44>   DW_AT_byte_size   : 2
    <45>   DW_AT_encoding    : 5	(signed)
    <46>   DW_AT_name        : (indirect string, offset: 0x8897d): short int
 <1><4a>: Abbrev Number: 3 (DW_TAG_typedef)
    <4b>   DW_AT_name        : (indirect string, offset: 0x96cfa): __uint16_t
    <4f>   DW_AT_decl_file   : 2
    <50>   DW_AT_decl_line   : 57
    <51>   DW_AT_decl_column : 25
    <52>   DW_AT_type        : <0x56>
 <1><56>: Abbrev Number: 2 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 2
    <58>   DW_AT_encoding    : 7	(unsigned)
    <59>   DW_AT_name        : (indirect string, offset: 0x5ea4b): short unsigned int
 <1><5d>: Abbrev Number: 3 (DW_TAG_typedef)
    <5e>   DW_AT_name        : (indirect string, offset: 0x9c951): __int32_t
    <62>   DW_AT_decl_file   : 2
    <63>   DW_AT_decl_line   : 77
    <64>   DW_AT_decl_column : 24
    <65>   DW_AT_type        : <0x69>
 <1><69>: Abbrev Number: 2 (DW_TAG_base_type)
    <6a>   DW_AT_byte_size   : 4
    <6b>   DW_AT_encoding    : 5	(signed)
    <6c>   DW_AT_name        : (indirect string, offset: 0x114ba1): long int
 <1><70>: Abbrev Number: 3 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x127c4): __uint32_t
    <75>   DW_AT_decl_file   : 2
    <76>   DW_AT_decl_line   : 79
    <77>   DW_AT_decl_column : 25
    <78>   DW_AT_type        : <0x7c>
 <1><7c>: Abbrev Number: 2 (DW_TAG_base_type)
    <7d>   DW_AT_byte_size   : 4
    <7e>   DW_AT_encoding    : 7	(unsigned)
    <7f>   DW_AT_name        : (indirect string, offset: 0xcd5fe): long unsigned int
 <1><83>: Abbrev Number: 2 (DW_TAG_base_type)
    <84>   DW_AT_byte_size   : 8
    <85>   DW_AT_encoding    : 5	(signed)
    <86>   DW_AT_name        : (indirect string, offset: 0x9671): long long int
 <1><8a>: Abbrev Number: 2 (DW_TAG_base_type)
    <8b>   DW_AT_byte_size   : 8
    <8c>   DW_AT_encoding    : 7	(unsigned)
    <8d>   DW_AT_name        : (indirect string, offset: 0xa6647): long long unsigned int
 <1><91>: Abbrev Number: 4 (DW_TAG_base_type)
    <92>   DW_AT_byte_size   : 4
    <93>   DW_AT_encoding    : 5	(signed)
    <94>   DW_AT_name        : int
 <1><98>: Abbrev Number: 2 (DW_TAG_base_type)
    <99>   DW_AT_byte_size   : 4
    <9a>   DW_AT_encoding    : 7	(unsigned)
    <9b>   DW_AT_name        : (indirect string, offset: 0x96dbf): unsigned int
 <1><9f>: Abbrev Number: 3 (DW_TAG_typedef)
    <a0>   DW_AT_name        : (indirect string, offset: 0xaf3f1): uint8_t
    <a4>   DW_AT_decl_file   : 3
    <a5>   DW_AT_decl_line   : 24
    <a6>   DW_AT_decl_column : 19
    <a7>   DW_AT_type        : <0x30>
 <1><ab>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac>   DW_AT_name        : (indirect string, offset: 0x96cfc): uint16_t
    <b0>   DW_AT_decl_file   : 3
    <b1>   DW_AT_decl_line   : 36
    <b2>   DW_AT_decl_column : 20
    <b3>   DW_AT_type        : <0x4a>
 <1><b7>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <b8>   DW_AT_type        : <0xab>
 <1><bc>: Abbrev Number: 3 (DW_TAG_typedef)
    <bd>   DW_AT_name        : (indirect string, offset: 0x9c953): int32_t
    <c1>   DW_AT_decl_file   : 3
    <c2>   DW_AT_decl_line   : 44
    <c3>   DW_AT_decl_column : 19
    <c4>   DW_AT_type        : <0x5d>
 <1><c8>: Abbrev Number: 3 (DW_TAG_typedef)
    <c9>   DW_AT_name        : (indirect string, offset: 0x127c6): uint32_t
    <cd>   DW_AT_decl_file   : 3
    <ce>   DW_AT_decl_line   : 48
    <cf>   DW_AT_decl_column : 20
    <d0>   DW_AT_type        : <0x70>
 <1><d4>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <d5>   DW_AT_type        : <0xc8>
 <1><d9>: Abbrev Number: 6 (DW_TAG_array_type)
    <da>   DW_AT_type        : <0xc8>
    <de>   DW_AT_sibling     : <0xe9>
 <2><e2>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <e3>   DW_AT_type        : <0x98>
    <e7>   DW_AT_upper_bound : 1
 <2><e8>: Abbrev Number: 0
 <1><e9>: Abbrev Number: 6 (DW_TAG_array_type)
    <ea>   DW_AT_type        : <0xc8>
    <ee>   DW_AT_sibling     : <0xf9>
 <2><f2>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <f3>   DW_AT_type        : <0x98>
    <f7>   DW_AT_upper_bound : 7
 <2><f8>: Abbrev Number: 0
 <1><f9>: Abbrev Number: 8 (DW_TAG_structure_type)
    <fa>   DW_AT_byte_size   : 48
    <fb>   DW_AT_decl_file   : 4
    <fc>   DW_AT_decl_line   : 268
    <fe>   DW_AT_decl_column : 9
    <ff>   DW_AT_sibling     : <0x1ac>
 <2><103>: Abbrev Number: 9 (DW_TAG_member)
    <104>   DW_AT_name        : CR1
    <108>   DW_AT_decl_file   : 4
    <109>   DW_AT_decl_line   : 270
    <10b>   DW_AT_decl_column : 17
    <10c>   DW_AT_type        : <0xd4>
    <110>   DW_AT_data_member_location: 0
 <2><111>: Abbrev Number: 9 (DW_TAG_member)
    <112>   DW_AT_name        : CR2
    <116>   DW_AT_decl_file   : 4
    <117>   DW_AT_decl_line   : 271
    <119>   DW_AT_decl_column : 17
    <11a>   DW_AT_type        : <0xd4>
    <11e>   DW_AT_data_member_location: 4
 <2><11f>: Abbrev Number: 10 (DW_TAG_member)
    <120>   DW_AT_name        : (indirect string, offset: 0xc6222): OAR1
    <124>   DW_AT_decl_file   : 4
    <125>   DW_AT_decl_line   : 272
    <127>   DW_AT_decl_column : 17
    <128>   DW_AT_type        : <0xd4>
    <12c>   DW_AT_data_member_location: 8
 <2><12d>: Abbrev Number: 10 (DW_TAG_member)
    <12e>   DW_AT_name        : (indirect string, offset: 0xc6227): OAR2
    <132>   DW_AT_decl_file   : 4
    <133>   DW_AT_decl_line   : 273
    <135>   DW_AT_decl_column : 17
    <136>   DW_AT_type        : <0xd4>
    <13a>   DW_AT_data_member_location: 12
 <2><13b>: Abbrev Number: 10 (DW_TAG_member)
    <13c>   DW_AT_name        : (indirect string, offset: 0x10eabf): TIMINGR
    <140>   DW_AT_decl_file   : 4
    <141>   DW_AT_decl_line   : 274
    <143>   DW_AT_decl_column : 17
    <144>   DW_AT_type        : <0xd4>
    <148>   DW_AT_data_member_location: 16
 <2><149>: Abbrev Number: 10 (DW_TAG_member)
    <14a>   DW_AT_name        : (indirect string, offset: 0xdab4d): TIMEOUTR
    <14e>   DW_AT_decl_file   : 4
    <14f>   DW_AT_decl_line   : 275
    <151>   DW_AT_decl_column : 17
    <152>   DW_AT_type        : <0xd4>
    <156>   DW_AT_data_member_location: 20
 <2><157>: Abbrev Number: 9 (DW_TAG_member)
    <158>   DW_AT_name        : ISR
    <15c>   DW_AT_decl_file   : 4
    <15d>   DW_AT_decl_line   : 276
    <15f>   DW_AT_decl_column : 17
    <160>   DW_AT_type        : <0xd4>
    <164>   DW_AT_data_member_location: 24
 <2><165>: Abbrev Number: 9 (DW_TAG_member)
    <166>   DW_AT_name        : ICR
    <16a>   DW_AT_decl_file   : 4
    <16b>   DW_AT_decl_line   : 277
    <16d>   DW_AT_decl_column : 17
    <16e>   DW_AT_type        : <0xd4>
    <172>   DW_AT_data_member_location: 28
 <2><173>: Abbrev Number: 10 (DW_TAG_member)
    <174>   DW_AT_name        : (indirect string, offset: 0x1276fa): PECR
    <178>   DW_AT_decl_file   : 4
    <179>   DW_AT_decl_line   : 278
    <17b>   DW_AT_decl_column : 17
    <17c>   DW_AT_type        : <0xd4>
    <180>   DW_AT_data_member_location: 32
 <2><181>: Abbrev Number: 10 (DW_TAG_member)
    <182>   DW_AT_name        : (indirect string, offset: 0x12f96b): RXDR
    <186>   DW_AT_decl_file   : 4
    <187>   DW_AT_decl_line   : 279
    <189>   DW_AT_decl_column : 17
    <18a>   DW_AT_type        : <0xd4>
    <18e>   DW_AT_data_member_location: 36
 <2><18f>: Abbrev Number: 10 (DW_TAG_member)
    <190>   DW_AT_name        : (indirect string, offset: 0x14a964): TXDR
    <194>   DW_AT_decl_file   : 4
    <195>   DW_AT_decl_line   : 280
    <197>   DW_AT_decl_column : 17
    <198>   DW_AT_type        : <0xd4>
    <19c>   DW_AT_data_member_location: 40
 <2><19d>: Abbrev Number: 10 (DW_TAG_member)
    <19e>   DW_AT_name        : (indirect string, offset: 0xb3bde): AUTOCR
    <1a2>   DW_AT_decl_file   : 4
    <1a3>   DW_AT_decl_line   : 281
    <1a5>   DW_AT_decl_column : 17
    <1a6>   DW_AT_type        : <0xd4>
    <1aa>   DW_AT_data_member_location: 44
 <2><1ab>: Abbrev Number: 0
 <1><1ac>: Abbrev Number: 11 (DW_TAG_typedef)
    <1ad>   DW_AT_name        : (indirect string, offset: 0xc664c): I2C_TypeDef
    <1b1>   DW_AT_decl_file   : 4
    <1b2>   DW_AT_decl_line   : 282
    <1b4>   DW_AT_decl_column : 3
    <1b5>   DW_AT_type        : <0xf9>
 <1><1b9>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1ba>   DW_AT_byte_size   : 128
    <1bb>   DW_AT_decl_file   : 4
    <1bc>   DW_AT_decl_line   : 441
    <1be>   DW_AT_decl_column : 9
    <1bf>   DW_AT_sibling     : <0x296>
 <2><1c3>: Abbrev Number: 10 (DW_TAG_member)
    <1c4>   DW_AT_name        : (indirect string, offset: 0xb4034): CLBAR
    <1c8>   DW_AT_decl_file   : 4
    <1c9>   DW_AT_decl_line   : 443
    <1cb>   DW_AT_decl_column : 17
    <1cc>   DW_AT_type        : <0xd4>
    <1d0>   DW_AT_data_member_location: 0
 <2><1d1>: Abbrev Number: 10 (DW_TAG_member)
    <1d2>   DW_AT_name        : (indirect string, offset: 0x644c1): RESERVED1
    <1d6>   DW_AT_decl_file   : 4
    <1d7>   DW_AT_decl_line   : 444
    <1d9>   DW_AT_decl_column : 17
    <1da>   DW_AT_type        : <0xd9>
    <1de>   DW_AT_data_member_location: 4
 <2><1df>: Abbrev Number: 10 (DW_TAG_member)
    <1e0>   DW_AT_name        : (indirect string, offset: 0x114302): CFCR
    <1e4>   DW_AT_decl_file   : 4
    <1e5>   DW_AT_decl_line   : 445
    <1e7>   DW_AT_decl_column : 17
    <1e8>   DW_AT_type        : <0xd4>
    <1ec>   DW_AT_data_member_location: 12
 <2><1ed>: Abbrev Number: 9 (DW_TAG_member)
    <1ee>   DW_AT_name        : CSR
    <1f2>   DW_AT_decl_file   : 4
    <1f3>   DW_AT_decl_line   : 446
    <1f5>   DW_AT_decl_column : 17
    <1f6>   DW_AT_type        : <0xd4>
    <1fa>   DW_AT_data_member_location: 16
 <2><1fb>: Abbrev Number: 9 (DW_TAG_member)
    <1fc>   DW_AT_name        : CCR
    <200>   DW_AT_decl_file   : 4
    <201>   DW_AT_decl_line   : 447
    <203>   DW_AT_decl_column : 17
    <204>   DW_AT_type        : <0xd4>
    <208>   DW_AT_data_member_location: 20
 <2><209>: Abbrev Number: 10 (DW_TAG_member)
    <20a>   DW_AT_name        : (indirect string, offset: 0x644cb): RESERVED2
    <20e>   DW_AT_decl_file   : 4
    <20f>   DW_AT_decl_line   : 448
    <211>   DW_AT_decl_column : 17
    <212>   DW_AT_type        : <0x296>
    <216>   DW_AT_data_member_location: 24
 <2><217>: Abbrev Number: 10 (DW_TAG_member)
    <218>   DW_AT_name        : (indirect string, offset: 0x10bf16): CTR1
    <21c>   DW_AT_decl_file   : 4
    <21d>   DW_AT_decl_line   : 449
    <21f>   DW_AT_decl_column : 17
    <220>   DW_AT_type        : <0xd4>
    <224>   DW_AT_data_member_location: 64
 <2><225>: Abbrev Number: 10 (DW_TAG_member)
    <226>   DW_AT_name        : (indirect string, offset: 0x10bf1b): CTR2
    <22a>   DW_AT_decl_file   : 4
    <22b>   DW_AT_decl_line   : 450
    <22d>   DW_AT_decl_column : 17
    <22e>   DW_AT_type        : <0xd4>
    <232>   DW_AT_data_member_location: 68
 <2><233>: Abbrev Number: 10 (DW_TAG_member)
    <234>   DW_AT_name        : (indirect string, offset: 0xc0f11): CBR1
    <238>   DW_AT_decl_file   : 4
    <239>   DW_AT_decl_line   : 451
    <23b>   DW_AT_decl_column : 17
    <23c>   DW_AT_type        : <0xd4>
    <240>   DW_AT_data_member_location: 72
 <2><241>: Abbrev Number: 10 (DW_TAG_member)
    <242>   DW_AT_name        : (indirect string, offset: 0xf098a): CSAR
    <246>   DW_AT_decl_file   : 4
    <247>   DW_AT_decl_line   : 452
    <249>   DW_AT_decl_column : 17
    <24a>   DW_AT_type        : <0xd4>
    <24e>   DW_AT_data_member_location: 76
 <2><24f>: Abbrev Number: 10 (DW_TAG_member)
    <250>   DW_AT_name        : (indirect string, offset: 0xe7524): CDAR
    <254>   DW_AT_decl_file   : 4
    <255>   DW_AT_decl_line   : 453
    <257>   DW_AT_decl_column : 17
    <258>   DW_AT_type        : <0xd4>
    <25c>   DW_AT_data_member_location: 80
 <2><25d>: Abbrev Number: 10 (DW_TAG_member)
    <25e>   DW_AT_name        : (indirect string, offset: 0x10bf20): CTR3
    <262>   DW_AT_decl_file   : 4
    <263>   DW_AT_decl_line   : 454
    <265>   DW_AT_decl_column : 17
    <266>   DW_AT_type        : <0xd4>
    <26a>   DW_AT_data_member_location: 84
 <2><26b>: Abbrev Number: 10 (DW_TAG_member)
    <26c>   DW_AT_name        : (indirect string, offset: 0xc0f16): CBR2
    <270>   DW_AT_decl_file   : 4
    <271>   DW_AT_decl_line   : 455
    <273>   DW_AT_decl_column : 17
    <274>   DW_AT_type        : <0xd4>
    <278>   DW_AT_data_member_location: 88
 <2><279>: Abbrev Number: 10 (DW_TAG_member)
    <27a>   DW_AT_name        : (indirect string, offset: 0x644d5): RESERVED3
    <27e>   DW_AT_decl_file   : 4
    <27f>   DW_AT_decl_line   : 456
    <281>   DW_AT_decl_column : 17
    <282>   DW_AT_type        : <0xe9>
    <286>   DW_AT_data_member_location: 92
 <2><287>: Abbrev Number: 10 (DW_TAG_member)
    <288>   DW_AT_name        : (indirect string, offset: 0x149b73): CLLR
    <28c>   DW_AT_decl_file   : 4
    <28d>   DW_AT_decl_line   : 457
    <28f>   DW_AT_decl_column : 17
    <290>   DW_AT_type        : <0xd4>
    <294>   DW_AT_data_member_location: 124
 <2><295>: Abbrev Number: 0
 <1><296>: Abbrev Number: 6 (DW_TAG_array_type)
    <297>   DW_AT_type        : <0xc8>
    <29b>   DW_AT_sibling     : <0x2a6>
 <2><29f>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <2a0>   DW_AT_type        : <0x98>
    <2a4>   DW_AT_upper_bound : 9
 <2><2a5>: Abbrev Number: 0
 <1><2a6>: Abbrev Number: 11 (DW_TAG_typedef)
    <2a7>   DW_AT_name        : (indirect string, offset: 0x27a34): DMA_Channel_TypeDef
    <2ab>   DW_AT_decl_file   : 4
    <2ac>   DW_AT_decl_line   : 458
    <2ae>   DW_AT_decl_column : 3
    <2af>   DW_AT_type        : <0x1b9>
 <1><2b3>: Abbrev Number: 2 (DW_TAG_base_type)
    <2b4>   DW_AT_byte_size   : 8
    <2b5>   DW_AT_encoding    : 4	(float)
    <2b6>   DW_AT_name        : (indirect string, offset: 0xba136): long double
 <1><2ba>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <2bb>   DW_AT_byte_size   : 4
 <1><2bc>: Abbrev Number: 2 (DW_TAG_base_type)
    <2bd>   DW_AT_byte_size   : 1
    <2be>   DW_AT_encoding    : 8	(unsigned char)
    <2bf>   DW_AT_name        : (indirect string, offset: 0x115948): char
 <1><2c3>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c4>   DW_AT_byte_size   : 4
    <2c5>   DW_AT_encoding    : 4	(float)
    <2c6>   DW_AT_name        : (indirect string, offset: 0x10adaa): float
 <1><2ca>: Abbrev Number: 2 (DW_TAG_base_type)
    <2cb>   DW_AT_byte_size   : 8
    <2cc>   DW_AT_encoding    : 4	(float)
    <2cd>   DW_AT_name        : (indirect string, offset: 0xba13b): double
 <1><2d1>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <2d2>   DW_AT_encoding    : 7	(unsigned)
    <2d3>   DW_AT_byte_size   : 1
    <2d4>   DW_AT_type        : <0x3c>
    <2d8>   DW_AT_decl_file   : 5
    <2d9>   DW_AT_decl_line   : 44
    <2da>   DW_AT_decl_column : 1
    <2db>   DW_AT_sibling     : <0x2f8>
 <2><2df>: Abbrev Number: 14 (DW_TAG_enumerator)
    <2e0>   DW_AT_name        : (indirect string, offset: 0x10a786): HAL_OK
    <2e4>   DW_AT_const_value : 0
 <2><2e5>: Abbrev Number: 14 (DW_TAG_enumerator)
    <2e6>   DW_AT_name        : (indirect string, offset: 0x3a36a): HAL_ERROR
    <2ea>   DW_AT_const_value : 1
 <2><2eb>: Abbrev Number: 14 (DW_TAG_enumerator)
    <2ec>   DW_AT_name        : (indirect string, offset: 0x16b12): HAL_BUSY
    <2f0>   DW_AT_const_value : 2
 <2><2f1>: Abbrev Number: 14 (DW_TAG_enumerator)
    <2f2>   DW_AT_name        : (indirect string, offset: 0x20cea): HAL_TIMEOUT
    <2f6>   DW_AT_const_value : 3
 <2><2f7>: Abbrev Number: 0
 <1><2f8>: Abbrev Number: 3 (DW_TAG_typedef)
    <2f9>   DW_AT_name        : (indirect string, offset: 0x10dcda): HAL_StatusTypeDef
    <2fd>   DW_AT_decl_file   : 5
    <2fe>   DW_AT_decl_line   : 49
    <2ff>   DW_AT_decl_column : 3
    <300>   DW_AT_type        : <0x2d1>
 <1><304>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <305>   DW_AT_encoding    : 7	(unsigned)
    <306>   DW_AT_byte_size   : 1
    <307>   DW_AT_type        : <0x3c>
    <30b>   DW_AT_decl_file   : 5
    <30c>   DW_AT_decl_line   : 55
    <30d>   DW_AT_decl_column : 1
    <30e>   DW_AT_sibling     : <0x31f>
 <2><312>: Abbrev Number: 14 (DW_TAG_enumerator)
    <313>   DW_AT_name        : (indirect string, offset: 0x6f0a7): HAL_UNLOCKED
    <317>   DW_AT_const_value : 0
 <2><318>: Abbrev Number: 14 (DW_TAG_enumerator)
    <319>   DW_AT_name        : (indirect string, offset: 0x109aa0): HAL_LOCKED
    <31d>   DW_AT_const_value : 1
 <2><31e>: Abbrev Number: 0
 <1><31f>: Abbrev Number: 3 (DW_TAG_typedef)
    <320>   DW_AT_name        : (indirect string, offset: 0x781c4): HAL_LockTypeDef
    <324>   DW_AT_decl_file   : 5
    <325>   DW_AT_decl_line   : 58
    <326>   DW_AT_decl_column : 3
    <327>   DW_AT_type        : <0x304>
 <1><32b>: Abbrev Number: 15 (DW_TAG_structure_type)
    <32c>   DW_AT_byte_size   : 52
    <32d>   DW_AT_decl_file   : 6
    <32e>   DW_AT_decl_line   : 49
    <32f>   DW_AT_decl_column : 9
    <330>   DW_AT_sibling     : <0x3de>
 <2><334>: Abbrev Number: 16 (DW_TAG_member)
    <335>   DW_AT_name        : (indirect string, offset: 0xc5518): Request
    <339>   DW_AT_decl_file   : 6
    <33a>   DW_AT_decl_line   : 51
    <33b>   DW_AT_decl_column : 12
    <33c>   DW_AT_type        : <0xc8>
    <340>   DW_AT_data_member_location: 0
 <2><341>: Abbrev Number: 16 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0xc5513): BlkHWRequest
    <346>   DW_AT_decl_file   : 6
    <347>   DW_AT_decl_line   : 54
    <348>   DW_AT_decl_column : 12
    <349>   DW_AT_type        : <0xc8>
    <34d>   DW_AT_data_member_location: 4
 <2><34e>: Abbrev Number: 16 (DW_TAG_member)
    <34f>   DW_AT_name        : (indirect string, offset: 0x14a7e2): Direction
    <353>   DW_AT_decl_file   : 6
    <354>   DW_AT_decl_line   : 58
    <355>   DW_AT_decl_column : 12
    <356>   DW_AT_type        : <0xc8>
    <35a>   DW_AT_data_member_location: 8
 <2><35b>: Abbrev Number: 16 (DW_TAG_member)
    <35c>   DW_AT_name        : (indirect string, offset: 0x1162b9): SrcInc
    <360>   DW_AT_decl_file   : 6
    <361>   DW_AT_decl_line   : 61
    <362>   DW_AT_decl_column : 12
    <363>   DW_AT_type        : <0xc8>
    <367>   DW_AT_data_member_location: 12
 <2><368>: Abbrev Number: 16 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0x1407b1): DestInc
    <36d>   DW_AT_decl_file   : 6
    <36e>   DW_AT_decl_line   : 64
    <36f>   DW_AT_decl_column : 12
    <370>   DW_AT_type        : <0xc8>
    <374>   DW_AT_data_member_location: 16
 <2><375>: Abbrev Number: 16 (DW_TAG_member)
    <376>   DW_AT_name        : (indirect string, offset: 0x7d78): SrcDataWidth
    <37a>   DW_AT_decl_file   : 6
    <37b>   DW_AT_decl_line   : 67
    <37c>   DW_AT_decl_column : 12
    <37d>   DW_AT_type        : <0xc8>
    <381>   DW_AT_data_member_location: 20
 <2><382>: Abbrev Number: 16 (DW_TAG_member)
    <383>   DW_AT_name        : (indirect string, offset: 0x8ec53): DestDataWidth
    <387>   DW_AT_decl_file   : 6
    <388>   DW_AT_decl_line   : 70
    <389>   DW_AT_decl_column : 12
    <38a>   DW_AT_type        : <0xc8>
    <38e>   DW_AT_data_member_location: 24
 <2><38f>: Abbrev Number: 16 (DW_TAG_member)
    <390>   DW_AT_name        : (indirect string, offset: 0x14892f): Priority
    <394>   DW_AT_decl_file   : 6
    <395>   DW_AT_decl_line   : 73
    <396>   DW_AT_decl_column : 12
    <397>   DW_AT_type        : <0xc8>
    <39b>   DW_AT_data_member_location: 28
 <2><39c>: Abbrev Number: 16 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0x11908d): SrcBurstLength
    <3a1>   DW_AT_decl_file   : 6
    <3a2>   DW_AT_decl_line   : 76
    <3a3>   DW_AT_decl_column : 12
    <3a4>   DW_AT_type        : <0xc8>
    <3a8>   DW_AT_data_member_location: 32
 <2><3a9>: Abbrev Number: 16 (DW_TAG_member)
    <3aa>   DW_AT_name        : (indirect string, offset: 0x130499): DestBurstLength
    <3ae>   DW_AT_decl_file   : 6
    <3af>   DW_AT_decl_line   : 80
    <3b0>   DW_AT_decl_column : 12
    <3b1>   DW_AT_type        : <0xc8>
    <3b5>   DW_AT_data_member_location: 36
 <2><3b6>: Abbrev Number: 16 (DW_TAG_member)
    <3b7>   DW_AT_name        : (indirect string, offset: 0xbe34f): TransferAllocatedPort
    <3bb>   DW_AT_decl_file   : 6
    <3bc>   DW_AT_decl_line   : 84
    <3bd>   DW_AT_decl_column : 12
    <3be>   DW_AT_type        : <0xc8>
    <3c2>   DW_AT_data_member_location: 40
 <2><3c3>: Abbrev Number: 16 (DW_TAG_member)
    <3c4>   DW_AT_name        : (indirect string, offset: 0xdc903): TransferEventMode
    <3c8>   DW_AT_decl_file   : 6
    <3c9>   DW_AT_decl_line   : 87
    <3ca>   DW_AT_decl_column : 12
    <3cb>   DW_AT_type        : <0xc8>
    <3cf>   DW_AT_data_member_location: 44
 <2><3d0>: Abbrev Number: 16 (DW_TAG_member)
    <3d1>   DW_AT_name        : (indirect string, offset: 0x14c62b): Mode
    <3d5>   DW_AT_decl_file   : 6
    <3d6>   DW_AT_decl_line   : 90
    <3d7>   DW_AT_decl_column : 12
    <3d8>   DW_AT_type        : <0xc8>
    <3dc>   DW_AT_data_member_location: 48
 <2><3dd>: Abbrev Number: 0
 <1><3de>: Abbrev Number: 3 (DW_TAG_typedef)
    <3df>   DW_AT_name        : (indirect string, offset: 0xd682d): DMA_InitTypeDef
    <3e3>   DW_AT_decl_file   : 6
    <3e4>   DW_AT_decl_line   : 93
    <3e5>   DW_AT_decl_column : 3
    <3e6>   DW_AT_type        : <0x32b>
 <1><3ea>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3eb>   DW_AT_byte_size   : 20
    <3ec>   DW_AT_decl_file   : 6
    <3ed>   DW_AT_decl_line   : 98
    <3ee>   DW_AT_decl_column : 9
    <3ef>   DW_AT_sibling     : <0x435>
 <2><3f3>: Abbrev Number: 16 (DW_TAG_member)
    <3f4>   DW_AT_name        : (indirect string, offset: 0x14892f): Priority
    <3f8>   DW_AT_decl_file   : 6
    <3f9>   DW_AT_decl_line   : 100
    <3fa>   DW_AT_decl_column : 12
    <3fb>   DW_AT_type        : <0xc8>
    <3ff>   DW_AT_data_member_location: 0
 <2><400>: Abbrev Number: 16 (DW_TAG_member)
    <401>   DW_AT_name        : (indirect string, offset: 0x137f89): LinkStepMode
    <405>   DW_AT_decl_file   : 6
    <406>   DW_AT_decl_line   : 103
    <407>   DW_AT_decl_column : 12
    <408>   DW_AT_type        : <0xc8>
    <40c>   DW_AT_data_member_location: 4
 <2><40d>: Abbrev Number: 16 (DW_TAG_member)
    <40e>   DW_AT_name        : (indirect string, offset: 0x4f38f): LinkAllocatedPort
    <412>   DW_AT_decl_file   : 6
    <413>   DW_AT_decl_line   : 106
    <414>   DW_AT_decl_column : 12
    <415>   DW_AT_type        : <0xc8>
    <419>   DW_AT_data_member_location: 8
 <2><41a>: Abbrev Number: 16 (DW_TAG_member)
    <41b>   DW_AT_name        : (indirect string, offset: 0xdc903): TransferEventMode
    <41f>   DW_AT_decl_file   : 6
    <420>   DW_AT_decl_line   : 109
    <421>   DW_AT_decl_column : 12
    <422>   DW_AT_type        : <0xc8>
    <426>   DW_AT_data_member_location: 12
 <2><427>: Abbrev Number: 16 (DW_TAG_member)
    <428>   DW_AT_name        : (indirect string, offset: 0xb44db): LinkedListMode
    <42c>   DW_AT_decl_file   : 6
    <42d>   DW_AT_decl_line   : 112
    <42e>   DW_AT_decl_column : 12
    <42f>   DW_AT_type        : <0xc8>
    <433>   DW_AT_data_member_location: 16
 <2><434>: Abbrev Number: 0
 <1><435>: Abbrev Number: 3 (DW_TAG_typedef)
    <436>   DW_AT_name        : (indirect string, offset: 0x4d2e8): DMA_InitLinkedListTypeDef
    <43a>   DW_AT_decl_file   : 6
    <43b>   DW_AT_decl_line   : 115
    <43c>   DW_AT_decl_column : 3
    <43d>   DW_AT_type        : <0x3ea>
 <1><441>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <442>   DW_AT_encoding    : 7	(unsigned)
    <443>   DW_AT_byte_size   : 1
    <444>   DW_AT_type        : <0x3c>
    <448>   DW_AT_decl_file   : 6
    <449>   DW_AT_decl_line   : 121
    <44a>   DW_AT_decl_column : 1
    <44b>   DW_AT_sibling     : <0x474>
 <2><44f>: Abbrev Number: 14 (DW_TAG_enumerator)
    <450>   DW_AT_name        : (indirect string, offset: 0x4829b): HAL_DMA_STATE_RESET
    <454>   DW_AT_const_value : 0
 <2><455>: Abbrev Number: 14 (DW_TAG_enumerator)
    <456>   DW_AT_name        : (indirect string, offset: 0x24a04): HAL_DMA_STATE_READY
    <45a>   DW_AT_const_value : 1
 <2><45b>: Abbrev Number: 14 (DW_TAG_enumerator)
    <45c>   DW_AT_name        : (indirect string, offset: 0xa09e7): HAL_DMA_STATE_BUSY
    <460>   DW_AT_const_value : 2
 <2><461>: Abbrev Number: 14 (DW_TAG_enumerator)
    <462>   DW_AT_name        : (indirect string, offset: 0xd4b28): HAL_DMA_STATE_ERROR
    <466>   DW_AT_const_value : 3
 <2><467>: Abbrev Number: 14 (DW_TAG_enumerator)
    <468>   DW_AT_name        : (indirect string, offset: 0x101edb): HAL_DMA_STATE_ABORT
    <46c>   DW_AT_const_value : 4
 <2><46d>: Abbrev Number: 14 (DW_TAG_enumerator)
    <46e>   DW_AT_name        : (indirect string, offset: 0x5a02e): HAL_DMA_STATE_SUSPEND
    <472>   DW_AT_const_value : 5
 <2><473>: Abbrev Number: 0
 <1><474>: Abbrev Number: 3 (DW_TAG_typedef)
    <475>   DW_AT_name        : (indirect string, offset: 0x32714): HAL_DMA_StateTypeDef
    <479>   DW_AT_decl_file   : 6
    <47a>   DW_AT_decl_line   : 129
    <47b>   DW_AT_decl_column : 3
    <47c>   DW_AT_type        : <0x441>
 <1><480>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <481>   DW_AT_type        : <0x474>
 <1><485>: Abbrev Number: 17 (DW_TAG_structure_type)
    <486>   DW_AT_name        : (indirect string, offset: 0x9ba64): __DMA_HandleTypeDef
    <48a>   DW_AT_byte_size   : 120
    <48b>   DW_AT_decl_file   : 6
    <48c>   DW_AT_decl_line   : 158
    <48d>   DW_AT_decl_column : 16
    <48e>   DW_AT_sibling     : <0x549>
 <2><492>: Abbrev Number: 16 (DW_TAG_member)
    <493>   DW_AT_name        : (indirect string, offset: 0x5fd86): Instance
    <497>   DW_AT_decl_file   : 6
    <498>   DW_AT_decl_line   : 160
    <499>   DW_AT_decl_column : 30
    <49a>   DW_AT_type        : <0x549>
    <49e>   DW_AT_data_member_location: 0
 <2><49f>: Abbrev Number: 16 (DW_TAG_member)
    <4a0>   DW_AT_name        : (indirect string, offset: 0x14e4f5): Init
    <4a4>   DW_AT_decl_file   : 6
    <4a5>   DW_AT_decl_line   : 162
    <4a6>   DW_AT_decl_column : 29
    <4a7>   DW_AT_type        : <0x3de>
    <4ab>   DW_AT_data_member_location: 4
 <2><4ac>: Abbrev Number: 16 (DW_TAG_member)
    <4ad>   DW_AT_name        : (indirect string, offset: 0x30b40): InitLinkedList
    <4b1>   DW_AT_decl_file   : 6
    <4b2>   DW_AT_decl_line   : 164
    <4b3>   DW_AT_decl_column : 29
    <4b4>   DW_AT_type        : <0x435>
    <4b8>   DW_AT_data_member_location: 56
 <2><4b9>: Abbrev Number: 16 (DW_TAG_member)
    <4ba>   DW_AT_name        : (indirect string, offset: 0x14836c): Lock
    <4be>   DW_AT_decl_file   : 6
    <4bf>   DW_AT_decl_line   : 166
    <4c0>   DW_AT_decl_column : 29
    <4c1>   DW_AT_type        : <0x31f>
    <4c5>   DW_AT_data_member_location: 76
 <2><4c6>: Abbrev Number: 16 (DW_TAG_member)
    <4c7>   DW_AT_name        : (indirect string, offset: 0x14c62b): Mode
    <4cb>   DW_AT_decl_file   : 6
    <4cc>   DW_AT_decl_line   : 168
    <4cd>   DW_AT_decl_column : 29
    <4ce>   DW_AT_type        : <0xc8>
    <4d2>   DW_AT_data_member_location: 80
 <2><4d3>: Abbrev Number: 16 (DW_TAG_member)
    <4d4>   DW_AT_name        : (indirect string, offset: 0x151721): State
    <4d8>   DW_AT_decl_file   : 6
    <4d9>   DW_AT_decl_line   : 170
    <4da>   DW_AT_decl_column : 29
    <4db>   DW_AT_type        : <0x480>
    <4df>   DW_AT_data_member_location: 84
 <2><4e0>: Abbrev Number: 16 (DW_TAG_member)
    <4e1>   DW_AT_name        : (indirect string, offset: 0x13480c): ErrorCode
    <4e5>   DW_AT_decl_file   : 6
    <4e6>   DW_AT_decl_line   : 172
    <4e7>   DW_AT_decl_column : 29
    <4e8>   DW_AT_type        : <0xd4>
    <4ec>   DW_AT_data_member_location: 88
 <2><4ed>: Abbrev Number: 16 (DW_TAG_member)
    <4ee>   DW_AT_name        : (indirect string, offset: 0x5e2ed): Parent
    <4f2>   DW_AT_decl_file   : 6
    <4f3>   DW_AT_decl_line   : 174
    <4f4>   DW_AT_decl_column : 30
    <4f5>   DW_AT_type        : <0x2ba>
    <4f9>   DW_AT_data_member_location: 92
 <2><4fa>: Abbrev Number: 16 (DW_TAG_member)
    <4fb>   DW_AT_name        : (indirect string, offset: 0x91112): XferCpltCallback
    <4ff>   DW_AT_decl_file   : 6
    <500>   DW_AT_decl_line   : 176
    <501>   DW_AT_decl_column : 11
    <502>   DW_AT_type        : <0x560>
    <506>   DW_AT_data_member_location: 96
 <2><507>: Abbrev Number: 16 (DW_TAG_member)
    <508>   DW_AT_name        : (indirect string, offset: 0x65967): XferHalfCpltCallback
    <50c>   DW_AT_decl_file   : 6
    <50d>   DW_AT_decl_line   : 178
    <50e>   DW_AT_decl_column : 11
    <50f>   DW_AT_type        : <0x560>
    <513>   DW_AT_data_member_location: 100
 <2><514>: Abbrev Number: 16 (DW_TAG_member)
    <515>   DW_AT_name        : (indirect string, offset: 0x116a7): XferErrorCallback
    <519>   DW_AT_decl_file   : 6
    <51a>   DW_AT_decl_line   : 180
    <51b>   DW_AT_decl_column : 11
    <51c>   DW_AT_type        : <0x560>
    <520>   DW_AT_data_member_location: 104
 <2><521>: Abbrev Number: 16 (DW_TAG_member)
    <522>   DW_AT_name        : (indirect string, offset: 0x5eeb): XferAbortCallback
    <526>   DW_AT_decl_file   : 6
    <527>   DW_AT_decl_line   : 182
    <528>   DW_AT_decl_column : 11
    <529>   DW_AT_type        : <0x560>
    <52d>   DW_AT_data_member_location: 108
 <2><52e>: Abbrev Number: 16 (DW_TAG_member)
    <52f>   DW_AT_name        : (indirect string, offset: 0x7468c): XferSuspendCallback
    <533>   DW_AT_decl_file   : 6
    <534>   DW_AT_decl_line   : 184
    <535>   DW_AT_decl_column : 11
    <536>   DW_AT_type        : <0x560>
    <53a>   DW_AT_data_member_location: 112
 <2><53b>: Abbrev Number: 16 (DW_TAG_member)
    <53c>   DW_AT_name        : (indirect string, offset: 0x7e638): LinkedListQueue
    <540>   DW_AT_decl_file   : 6
    <541>   DW_AT_decl_line   : 186
    <542>   DW_AT_decl_column : 31
    <543>   DW_AT_type        : <0x5c2>
    <547>   DW_AT_data_member_location: 116
 <2><548>: Abbrev Number: 0
 <1><549>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <54a>   DW_AT_byte_size   : 4
    <54b>   DW_AT_type        : <0x2a6>
 <1><54f>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <550>   DW_AT_prototyped  : 1
    <550>   DW_AT_sibling     : <0x55a>
 <2><554>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <555>   DW_AT_type        : <0x55a>
 <2><559>: Abbrev Number: 0
 <1><55a>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <55b>   DW_AT_byte_size   : 4
    <55c>   DW_AT_type        : <0x485>
 <1><560>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <561>   DW_AT_byte_size   : 4
    <562>   DW_AT_type        : <0x54f>
 <1><566>: Abbrev Number: 17 (DW_TAG_structure_type)
    <567>   DW_AT_name        : (indirect string, offset: 0x297cc): __DMA_QListTypeDef
    <56b>   DW_AT_byte_size   : 24
    <56c>   DW_AT_decl_file   : 7
    <56d>   DW_AT_decl_line   : 170
    <56e>   DW_AT_decl_column : 16
    <56f>   DW_AT_sibling     : <0x5c2>
 <2><573>: Abbrev Number: 16 (DW_TAG_member)
    <574>   DW_AT_name        : (indirect string, offset: 0x149795): Head
    <578>   DW_AT_decl_file   : 7
    <579>   DW_AT_decl_line   : 172
    <57a>   DW_AT_decl_column : 35
    <57b>   DW_AT_type        : <0x636>
    <57f>   DW_AT_data_member_location: 0
 <2><580>: Abbrev Number: 16 (DW_TAG_member)
    <581>   DW_AT_name        : (indirect string, offset: 0x149c57): FirstCircularNode
    <585>   DW_AT_decl_file   : 7
    <586>   DW_AT_decl_line   : 174
    <587>   DW_AT_decl_column : 35
    <588>   DW_AT_type        : <0x636>
    <58c>   DW_AT_data_member_location: 4
 <2><58d>: Abbrev Number: 16 (DW_TAG_member)
    <58e>   DW_AT_name        : (indirect string, offset: 0xd7e34): NodeNumber
    <592>   DW_AT_decl_file   : 7
    <593>   DW_AT_decl_line   : 176
    <594>   DW_AT_decl_column : 34
    <595>   DW_AT_type        : <0xc8>
    <599>   DW_AT_data_member_location: 8
 <2><59a>: Abbrev Number: 16 (DW_TAG_member)
    <59b>   DW_AT_name        : (indirect string, offset: 0x151721): State
    <59f>   DW_AT_decl_file   : 7
    <5a0>   DW_AT_decl_line   : 178
    <5a1>   DW_AT_decl_column : 34
    <5a2>   DW_AT_type        : <0x601>
    <5a6>   DW_AT_data_member_location: 12
 <2><5a7>: Abbrev Number: 16 (DW_TAG_member)
    <5a8>   DW_AT_name        : (indirect string, offset: 0x13480c): ErrorCode
    <5ac>   DW_AT_decl_file   : 7
    <5ad>   DW_AT_decl_line   : 180
    <5ae>   DW_AT_decl_column : 34
    <5af>   DW_AT_type        : <0xd4>
    <5b3>   DW_AT_data_member_location: 16
 <2><5b4>: Abbrev Number: 16 (DW_TAG_member)
    <5b5>   DW_AT_name        : (indirect string, offset: 0x14c516): Type
    <5b9>   DW_AT_decl_file   : 7
    <5ba>   DW_AT_decl_line   : 182
    <5bb>   DW_AT_decl_column : 34
    <5bc>   DW_AT_type        : <0xd4>
    <5c0>   DW_AT_data_member_location: 20
 <2><5c1>: Abbrev Number: 0
 <1><5c2>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <5c3>   DW_AT_byte_size   : 4
    <5c4>   DW_AT_type        : <0x566>
 <1><5c8>: Abbrev Number: 3 (DW_TAG_typedef)
    <5c9>   DW_AT_name        : (indirect string, offset: 0x9ba66): DMA_HandleTypeDef
    <5cd>   DW_AT_decl_file   : 6
    <5ce>   DW_AT_decl_line   : 188
    <5cf>   DW_AT_decl_column : 3
    <5d0>   DW_AT_type        : <0x485>
 <1><5d4>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <5d5>   DW_AT_encoding    : 7	(unsigned)
    <5d6>   DW_AT_byte_size   : 1
    <5d7>   DW_AT_type        : <0x3c>
    <5db>   DW_AT_decl_file   : 7
    <5dc>   DW_AT_decl_line   : 123
    <5dd>   DW_AT_decl_column : 1
    <5de>   DW_AT_sibling     : <0x5f5>
 <2><5e2>: Abbrev Number: 14 (DW_TAG_enumerator)
    <5e3>   DW_AT_name        : (indirect string, offset: 0xa97e5): HAL_DMA_QUEUE_STATE_RESET
    <5e7>   DW_AT_const_value : 0
 <2><5e8>: Abbrev Number: 14 (DW_TAG_enumerator)
    <5e9>   DW_AT_name        : (indirect string, offset: 0x5f73b): HAL_DMA_QUEUE_STATE_READY
    <5ed>   DW_AT_const_value : 1
 <2><5ee>: Abbrev Number: 14 (DW_TAG_enumerator)
    <5ef>   DW_AT_name        : (indirect string, offset: 0xd5ece): HAL_DMA_QUEUE_STATE_BUSY
    <5f3>   DW_AT_const_value : 2
 <2><5f4>: Abbrev Number: 0
 <1><5f5>: Abbrev Number: 3 (DW_TAG_typedef)
    <5f6>   DW_AT_name        : (indirect string, offset: 0x9aa3b): HAL_DMA_QStateTypeDef
    <5fa>   DW_AT_decl_file   : 7
    <5fb>   DW_AT_decl_line   : 128
    <5fc>   DW_AT_decl_column : 3
    <5fd>   DW_AT_type        : <0x5d4>
 <1><601>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <602>   DW_AT_type        : <0x5f5>
 <1><606>: Abbrev Number: 15 (DW_TAG_structure_type)
    <607>   DW_AT_byte_size   : 36
    <608>   DW_AT_decl_file   : 7
    <609>   DW_AT_decl_line   : 160
    <60a>   DW_AT_decl_column : 9
    <60b>   DW_AT_sibling     : <0x62a>
 <2><60f>: Abbrev Number: 16 (DW_TAG_member)
    <610>   DW_AT_name        : (indirect string, offset: 0xbe0b9): LinkRegisters
    <614>   DW_AT_decl_file   : 7
    <615>   DW_AT_decl_line   : 162
    <616>   DW_AT_decl_column : 12
    <617>   DW_AT_type        : <0xe9>
    <61b>   DW_AT_data_member_location: 0
 <2><61c>: Abbrev Number: 16 (DW_TAG_member)
    <61d>   DW_AT_name        : (indirect string, offset: 0x149bf3): NodeInfo
    <621>   DW_AT_decl_file   : 7
    <622>   DW_AT_decl_line   : 163
    <623>   DW_AT_decl_column : 12
    <624>   DW_AT_type        : <0xc8>
    <628>   DW_AT_data_member_location: 32
 <2><629>: Abbrev Number: 0
 <1><62a>: Abbrev Number: 3 (DW_TAG_typedef)
    <62b>   DW_AT_name        : (indirect string, offset: 0x5ba54): DMA_NodeTypeDef
    <62f>   DW_AT_decl_file   : 7
    <630>   DW_AT_decl_line   : 165
    <631>   DW_AT_decl_column : 3
    <632>   DW_AT_type        : <0x606>
 <1><636>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <637>   DW_AT_byte_size   : 4
    <638>   DW_AT_type        : <0x62a>
 <1><63c>: Abbrev Number: 15 (DW_TAG_structure_type)
    <63d>   DW_AT_byte_size   : 32
    <63e>   DW_AT_decl_file   : 8
    <63f>   DW_AT_decl_line   : 47
    <640>   DW_AT_decl_column : 9
    <641>   DW_AT_sibling     : <0x6ae>
 <2><645>: Abbrev Number: 16 (DW_TAG_member)
    <646>   DW_AT_name        : (indirect string, offset: 0x13a743): Timing
    <64a>   DW_AT_decl_file   : 8
    <64b>   DW_AT_decl_line   : 49
    <64c>   DW_AT_decl_column : 12
    <64d>   DW_AT_type        : <0xc8>
    <651>   DW_AT_data_member_location: 0
 <2><652>: Abbrev Number: 16 (DW_TAG_member)
    <653>   DW_AT_name        : (indirect string, offset: 0x27abb): OwnAddress1
    <657>   DW_AT_decl_file   : 8
    <658>   DW_AT_decl_line   : 53
    <659>   DW_AT_decl_column : 12
    <65a>   DW_AT_type        : <0xc8>
    <65e>   DW_AT_data_member_location: 4
 <2><65f>: Abbrev Number: 16 (DW_TAG_member)
    <660>   DW_AT_name        : (indirect string, offset: 0xe233b): AddressingMode
    <664>   DW_AT_decl_file   : 8
    <665>   DW_AT_decl_line   : 56
    <666>   DW_AT_decl_column : 12
    <667>   DW_AT_type        : <0xc8>
    <66b>   DW_AT_data_member_location: 8
 <2><66c>: Abbrev Number: 16 (DW_TAG_member)
    <66d>   DW_AT_name        : (indirect string, offset: 0x96227): DualAddressMode
    <671>   DW_AT_decl_file   : 8
    <672>   DW_AT_decl_line   : 59
    <673>   DW_AT_decl_column : 12
    <674>   DW_AT_type        : <0xc8>
    <678>   DW_AT_data_member_location: 12
 <2><679>: Abbrev Number: 16 (DW_TAG_member)
    <67a>   DW_AT_name        : (indirect string, offset: 0x27ac7): OwnAddress2
    <67e>   DW_AT_decl_file   : 8
    <67f>   DW_AT_decl_line   : 62
    <680>   DW_AT_decl_column : 12
    <681>   DW_AT_type        : <0xc8>
    <685>   DW_AT_data_member_location: 16
 <2><686>: Abbrev Number: 16 (DW_TAG_member)
    <687>   DW_AT_name        : (indirect string, offset: 0x590de): OwnAddress2Masks
    <68b>   DW_AT_decl_file   : 8
    <68c>   DW_AT_decl_line   : 65
    <68d>   DW_AT_decl_column : 12
    <68e>   DW_AT_type        : <0xc8>
    <692>   DW_AT_data_member_location: 20
 <2><693>: Abbrev Number: 16 (DW_TAG_member)
    <694>   DW_AT_name        : (indirect string, offset: 0x126310): GeneralCallMode
    <698>   DW_AT_decl_file   : 8
    <699>   DW_AT_decl_line   : 69
    <69a>   DW_AT_decl_column : 12
    <69b>   DW_AT_type        : <0xc8>
    <69f>   DW_AT_data_member_location: 24
 <2><6a0>: Abbrev Number: 16 (DW_TAG_member)
    <6a1>   DW_AT_name        : (indirect string, offset: 0x4643a): NoStretchMode
    <6a5>   DW_AT_decl_file   : 8
    <6a6>   DW_AT_decl_line   : 72
    <6a7>   DW_AT_decl_column : 12
    <6a8>   DW_AT_type        : <0xc8>
    <6ac>   DW_AT_data_member_location: 28
 <2><6ad>: Abbrev Number: 0
 <1><6ae>: Abbrev Number: 3 (DW_TAG_typedef)
    <6af>   DW_AT_name        : (indirect string, offset: 0x5447d): I2C_InitTypeDef
    <6b3>   DW_AT_decl_file   : 8
    <6b4>   DW_AT_decl_line   : 75
    <6b5>   DW_AT_decl_column : 3
    <6b6>   DW_AT_type        : <0x63c>
 <1><6ba>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <6bb>   DW_AT_encoding    : 7	(unsigned)
    <6bc>   DW_AT_byte_size   : 1
    <6bd>   DW_AT_type        : <0x3c>
    <6c1>   DW_AT_decl_file   : 8
    <6c2>   DW_AT_decl_line   : 109
    <6c3>   DW_AT_decl_column : 1
    <6c4>   DW_AT_sibling     : <0x70b>
 <2><6c8>: Abbrev Number: 14 (DW_TAG_enumerator)
    <6c9>   DW_AT_name        : (indirect string, offset: 0x104b5b): HAL_I2C_STATE_RESET
    <6cd>   DW_AT_const_value : 0
 <2><6ce>: Abbrev Number: 14 (DW_TAG_enumerator)
    <6cf>   DW_AT_name        : (indirect string, offset: 0xba7f6): HAL_I2C_STATE_READY
    <6d3>   DW_AT_const_value : 32
 <2><6d4>: Abbrev Number: 14 (DW_TAG_enumerator)
    <6d5>   DW_AT_name        : (indirect string, offset: 0x12860): HAL_I2C_STATE_BUSY
    <6d9>   DW_AT_const_value : 36
 <2><6da>: Abbrev Number: 14 (DW_TAG_enumerator)
    <6db>   DW_AT_name        : (indirect string, offset: 0x9bc6d): HAL_I2C_STATE_BUSY_TX
    <6df>   DW_AT_const_value : 33
 <2><6e0>: Abbrev Number: 14 (DW_TAG_enumerator)
    <6e1>   DW_AT_name        : (indirect string, offset: 0x1371f5): HAL_I2C_STATE_BUSY_RX
    <6e5>   DW_AT_const_value : 34
 <2><6e6>: Abbrev Number: 14 (DW_TAG_enumerator)
    <6e7>   DW_AT_name        : (indirect string, offset: 0x53f74): HAL_I2C_STATE_LISTEN
    <6eb>   DW_AT_const_value : 40
 <2><6ec>: Abbrev Number: 14 (DW_TAG_enumerator)
    <6ed>   DW_AT_name        : (indirect string, offset: 0xb6c69): HAL_I2C_STATE_BUSY_TX_LISTEN
    <6f1>   DW_AT_const_value : 41
 <2><6f2>: Abbrev Number: 14 (DW_TAG_enumerator)
    <6f3>   DW_AT_name        : (indirect string, offset: 0xeba9b): HAL_I2C_STATE_BUSY_RX_LISTEN
    <6f7>   DW_AT_const_value : 42
 <2><6f8>: Abbrev Number: 14 (DW_TAG_enumerator)
    <6f9>   DW_AT_name        : (indirect string, offset: 0x80661): HAL_I2C_STATE_ABORT
    <6fd>   DW_AT_const_value : 96
 <2><6fe>: Abbrev Number: 14 (DW_TAG_enumerator)
    <6ff>   DW_AT_name        : (indirect string, offset: 0x71397): HAL_I2C_STATE_TIMEOUT
    <703>   DW_AT_const_value : 160
 <2><704>: Abbrev Number: 14 (DW_TAG_enumerator)
    <705>   DW_AT_name        : (indirect string, offset: 0xe306a): HAL_I2C_STATE_ERROR
    <709>   DW_AT_const_value : 224
 <2><70a>: Abbrev Number: 0
 <1><70b>: Abbrev Number: 3 (DW_TAG_typedef)
    <70c>   DW_AT_name        : (indirect string, offset: 0xe4ed5): HAL_I2C_StateTypeDef
    <710>   DW_AT_decl_file   : 8
    <711>   DW_AT_decl_line   : 124
    <712>   DW_AT_decl_column : 3
    <713>   DW_AT_type        : <0x6ba>
 <1><717>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <718>   DW_AT_type        : <0x70b>
 <1><71c>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <71d>   DW_AT_encoding    : 7	(unsigned)
    <71e>   DW_AT_byte_size   : 1
    <71f>   DW_AT_type        : <0x3c>
    <723>   DW_AT_decl_file   : 8
    <724>   DW_AT_decl_line   : 149
    <725>   DW_AT_decl_column : 1
    <726>   DW_AT_sibling     : <0x743>
 <2><72a>: Abbrev Number: 14 (DW_TAG_enumerator)
    <72b>   DW_AT_name        : (indirect string, offset: 0x55e72): HAL_I2C_MODE_NONE
    <72f>   DW_AT_const_value : 0
 <2><730>: Abbrev Number: 14 (DW_TAG_enumerator)
    <731>   DW_AT_name        : (indirect string, offset: 0x95046): HAL_I2C_MODE_MASTER
    <735>   DW_AT_const_value : 16
 <2><736>: Abbrev Number: 14 (DW_TAG_enumerator)
    <737>   DW_AT_name        : (indirect string, offset: 0x5a7c3): HAL_I2C_MODE_SLAVE
    <73b>   DW_AT_const_value : 32
 <2><73c>: Abbrev Number: 14 (DW_TAG_enumerator)
    <73d>   DW_AT_name        : (indirect string, offset: 0x1313f): HAL_I2C_MODE_MEM
    <741>   DW_AT_const_value : 64
 <2><742>: Abbrev Number: 0
 <1><743>: Abbrev Number: 3 (DW_TAG_typedef)
    <744>   DW_AT_name        : (indirect string, offset: 0xbc827): HAL_I2C_ModeTypeDef
    <748>   DW_AT_decl_file   : 8
    <749>   DW_AT_decl_line   : 155
    <74a>   DW_AT_decl_column : 3
    <74b>   DW_AT_type        : <0x71c>
 <1><74f>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <750>   DW_AT_type        : <0x743>
 <1><754>: Abbrev Number: 17 (DW_TAG_structure_type)
    <755>   DW_AT_name        : (indirect string, offset: 0x1172fb): __I2C_HandleTypeDef
    <759>   DW_AT_byte_size   : 76
    <75a>   DW_AT_decl_file   : 8
    <75b>   DW_AT_decl_line   : 186
    <75c>   DW_AT_decl_column : 16
    <75d>   DW_AT_sibling     : <0x825>
 <2><761>: Abbrev Number: 16 (DW_TAG_member)
    <762>   DW_AT_name        : (indirect string, offset: 0x5fd86): Instance
    <766>   DW_AT_decl_file   : 8
    <767>   DW_AT_decl_line   : 188
    <768>   DW_AT_decl_column : 31
    <769>   DW_AT_type        : <0x825>
    <76d>   DW_AT_data_member_location: 0
 <2><76e>: Abbrev Number: 16 (DW_TAG_member)
    <76f>   DW_AT_name        : (indirect string, offset: 0x14e4f5): Init
    <773>   DW_AT_decl_file   : 8
    <774>   DW_AT_decl_line   : 190
    <775>   DW_AT_decl_column : 30
    <776>   DW_AT_type        : <0x6ae>
    <77a>   DW_AT_data_member_location: 4
 <2><77b>: Abbrev Number: 16 (DW_TAG_member)
    <77c>   DW_AT_name        : (indirect string, offset: 0xaeffa): pBuffPtr
    <780>   DW_AT_decl_file   : 8
    <781>   DW_AT_decl_line   : 192
    <782>   DW_AT_decl_column : 31
    <783>   DW_AT_type        : <0x82b>
    <787>   DW_AT_data_member_location: 36
 <2><788>: Abbrev Number: 16 (DW_TAG_member)
    <789>   DW_AT_name        : (indirect string, offset: 0x59d93): XferSize
    <78d>   DW_AT_decl_file   : 8
    <78e>   DW_AT_decl_line   : 194
    <78f>   DW_AT_decl_column : 30
    <790>   DW_AT_type        : <0xab>
    <794>   DW_AT_data_member_location: 40
 <2><795>: Abbrev Number: 16 (DW_TAG_member)
    <796>   DW_AT_name        : (indirect string, offset: 0x91be): XferCount
    <79a>   DW_AT_decl_file   : 8
    <79b>   DW_AT_decl_line   : 196
    <79c>   DW_AT_decl_column : 30
    <79d>   DW_AT_type        : <0xb7>
    <7a1>   DW_AT_data_member_location: 42
 <2><7a2>: Abbrev Number: 16 (DW_TAG_member)
    <7a3>   DW_AT_name        : (indirect string, offset: 0x14ae70): XferOptions
    <7a7>   DW_AT_decl_file   : 8
    <7a8>   DW_AT_decl_line   : 198
    <7a9>   DW_AT_decl_column : 30
    <7aa>   DW_AT_type        : <0xd4>
    <7ae>   DW_AT_data_member_location: 44
 <2><7af>: Abbrev Number: 16 (DW_TAG_member)
    <7b0>   DW_AT_name        : (indirect string, offset: 0x60c43): PreviousState
    <7b4>   DW_AT_decl_file   : 8
    <7b5>   DW_AT_decl_line   : 201
    <7b6>   DW_AT_decl_column : 30
    <7b7>   DW_AT_type        : <0xd4>
    <7bb>   DW_AT_data_member_location: 48
 <2><7bc>: Abbrev Number: 16 (DW_TAG_member)
    <7bd>   DW_AT_name        : (indirect string, offset: 0x12fdee): XferISR
    <7c1>   DW_AT_decl_file   : 8
    <7c2>   DW_AT_decl_line   : 203
    <7c3>   DW_AT_decl_column : 22
    <7c4>   DW_AT_type        : <0x850>
    <7c8>   DW_AT_data_member_location: 52
 <2><7c9>: Abbrev Number: 16 (DW_TAG_member)
    <7ca>   DW_AT_name        : (indirect string, offset: 0x97e57): hdmatx
    <7ce>   DW_AT_decl_file   : 8
    <7cf>   DW_AT_decl_line   : 206
    <7d0>   DW_AT_decl_column : 31
    <7d1>   DW_AT_type        : <0x856>
    <7d5>   DW_AT_data_member_location: 56
 <2><7d6>: Abbrev Number: 16 (DW_TAG_member)
    <7d7>   DW_AT_name        : (indirect string, offset: 0xa4ebf): hdmarx
    <7db>   DW_AT_decl_file   : 8
    <7dc>   DW_AT_decl_line   : 208
    <7dd>   DW_AT_decl_column : 31
    <7de>   DW_AT_type        : <0x856>
    <7e2>   DW_AT_data_member_location: 60
 <2><7e3>: Abbrev Number: 16 (DW_TAG_member)
    <7e4>   DW_AT_name        : (indirect string, offset: 0x14836c): Lock
    <7e8>   DW_AT_decl_file   : 8
    <7e9>   DW_AT_decl_line   : 210
    <7ea>   DW_AT_decl_column : 30
    <7eb>   DW_AT_type        : <0x31f>
    <7ef>   DW_AT_data_member_location: 64
 <2><7f0>: Abbrev Number: 16 (DW_TAG_member)
    <7f1>   DW_AT_name        : (indirect string, offset: 0x151721): State
    <7f5>   DW_AT_decl_file   : 8
    <7f6>   DW_AT_decl_line   : 212
    <7f7>   DW_AT_decl_column : 30
    <7f8>   DW_AT_type        : <0x717>
    <7fc>   DW_AT_data_member_location: 65
 <2><7fd>: Abbrev Number: 16 (DW_TAG_member)
    <7fe>   DW_AT_name        : (indirect string, offset: 0x14c62b): Mode
    <802>   DW_AT_decl_file   : 8
    <803>   DW_AT_decl_line   : 214
    <804>   DW_AT_decl_column : 30
    <805>   DW_AT_type        : <0x74f>
    <809>   DW_AT_data_member_location: 66
 <2><80a>: Abbrev Number: 16 (DW_TAG_member)
    <80b>   DW_AT_name        : (indirect string, offset: 0x13480c): ErrorCode
    <80f>   DW_AT_decl_file   : 8
    <810>   DW_AT_decl_line   : 216
    <811>   DW_AT_decl_column : 30
    <812>   DW_AT_type        : <0xd4>
    <816>   DW_AT_data_member_location: 68
 <2><817>: Abbrev Number: 16 (DW_TAG_member)
    <818>   DW_AT_name        : (indirect string, offset: 0x1279bc): AddrEventCount
    <81c>   DW_AT_decl_file   : 8
    <81d>   DW_AT_decl_line   : 218
    <81e>   DW_AT_decl_column : 30
    <81f>   DW_AT_type        : <0xd4>
    <823>   DW_AT_data_member_location: 72
 <2><824>: Abbrev Number: 0
 <1><825>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <826>   DW_AT_byte_size   : 4
    <827>   DW_AT_type        : <0x1ac>
 <1><82b>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <82c>   DW_AT_byte_size   : 4
    <82d>   DW_AT_type        : <0x9f>
 <1><831>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <832>   DW_AT_prototyped  : 1
    <832>   DW_AT_type        : <0x2f8>
    <836>   DW_AT_sibling     : <0x84a>
 <2><83a>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <83b>   DW_AT_type        : <0x84a>
 <2><83f>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <840>   DW_AT_type        : <0xc8>
 <2><844>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <845>   DW_AT_type        : <0xc8>
 <2><849>: Abbrev Number: 0
 <1><84a>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <84b>   DW_AT_byte_size   : 4
    <84c>   DW_AT_type        : <0x754>
 <1><850>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <851>   DW_AT_byte_size   : 4
    <852>   DW_AT_type        : <0x831>
 <1><856>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <857>   DW_AT_byte_size   : 4
    <858>   DW_AT_type        : <0x5c8>
 <1><85c>: Abbrev Number: 3 (DW_TAG_typedef)
    <85d>   DW_AT_name        : (indirect string, offset: 0x1172fd): I2C_HandleTypeDef
    <861>   DW_AT_decl_file   : 8
    <862>   DW_AT_decl_line   : 249
    <863>   DW_AT_decl_column : 3
    <864>   DW_AT_type        : <0x754>
 <1><868>: Abbrev Number: 22 (DW_TAG_variable)
    <869>   DW_AT_name        : (indirect string, offset: 0x13b028): hi2c1
    <86d>   DW_AT_decl_file   : 9
    <86e>   DW_AT_decl_line   : 35
    <86f>   DW_AT_decl_column : 26
    <870>   DW_AT_type        : <0x85c>
    <874>   DW_AT_external    : 1
    <874>   DW_AT_declaration : 1
 <1><874>: Abbrev Number: 23 (DW_TAG_subprogram)
    <875>   DW_AT_external    : 1
    <875>   DW_AT_name        : (indirect string, offset: 0x28402): HAL_GetTick
    <879>   DW_AT_decl_file   : 10
    <87a>   DW_AT_decl_line   : 662
    <87c>   DW_AT_decl_column : 10
    <87d>   DW_AT_prototyped  : 1
    <87d>   DW_AT_type        : <0xc8>
    <881>   DW_AT_declaration : 1
 <1><881>: Abbrev Number: 24 (DW_TAG_subprogram)
    <882>   DW_AT_external    : 1
    <882>   DW_AT_name        : (indirect string, offset: 0x96793): HAL_I2C_Mem_Read
    <886>   DW_AT_decl_file   : 8
    <887>   DW_AT_decl_line   : 633
    <889>   DW_AT_decl_column : 19
    <88a>   DW_AT_prototyped  : 1
    <88a>   DW_AT_type        : <0x2f8>
    <88e>   DW_AT_declaration : 1
    <88e>   DW_AT_sibling     : <0x8b6>
 <2><892>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <893>   DW_AT_type        : <0x8b6>
 <2><897>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <898>   DW_AT_type        : <0xab>
 <2><89c>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <89d>   DW_AT_type        : <0xab>
 <2><8a1>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <8a2>   DW_AT_type        : <0xab>
 <2><8a6>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <8a7>   DW_AT_type        : <0x82b>
 <2><8ab>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <8ac>   DW_AT_type        : <0xab>
 <2><8b0>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <8b1>   DW_AT_type        : <0xc8>
 <2><8b5>: Abbrev Number: 0
 <1><8b6>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <8b7>   DW_AT_byte_size   : 4
    <8b8>   DW_AT_type        : <0x85c>
 <1><8bc>: Abbrev Number: 24 (DW_TAG_subprogram)
    <8bd>   DW_AT_external    : 1
    <8bd>   DW_AT_name        : (indirect string, offset: 0xd7b7b): HAL_I2C_Mem_Write
    <8c1>   DW_AT_decl_file   : 8
    <8c2>   DW_AT_decl_line   : 631
    <8c4>   DW_AT_decl_column : 19
    <8c5>   DW_AT_prototyped  : 1
    <8c5>   DW_AT_type        : <0x2f8>
    <8c9>   DW_AT_declaration : 1
    <8c9>   DW_AT_sibling     : <0x8f1>
 <2><8cd>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <8ce>   DW_AT_type        : <0x8b6>
 <2><8d2>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <8d3>   DW_AT_type        : <0xab>
 <2><8d7>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <8d8>   DW_AT_type        : <0xab>
 <2><8dc>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <8dd>   DW_AT_type        : <0xab>
 <2><8e1>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <8e2>   DW_AT_type        : <0x82b>
 <2><8e6>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <8e7>   DW_AT_type        : <0xab>
 <2><8eb>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <8ec>   DW_AT_type        : <0xc8>
 <2><8f0>: Abbrev Number: 0
 <1><8f1>: Abbrev Number: 25 (DW_TAG_subprogram)
    <8f2>   DW_AT_external    : 1
    <8f2>   DW_AT_name        : (indirect string, offset: 0x675d1): HAL_I2C_MspDeInit
    <8f6>   DW_AT_decl_file   : 9
    <8f7>   DW_AT_decl_line   : 45
    <8f8>   DW_AT_decl_column : 6
    <8f9>   DW_AT_prototyped  : 1
    <8f9>   DW_AT_declaration : 1
    <8f9>   DW_AT_sibling     : <0x903>
 <2><8fd>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <8fe>   DW_AT_type        : <0x8b6>
 <2><902>: Abbrev Number: 0
 <1><903>: Abbrev Number: 26 (DW_TAG_subprogram)
    <904>   DW_AT_external    : 1
    <904>   DW_AT_name        : (indirect string, offset: 0xa4849): I2C1_Init
    <908>   DW_AT_decl_file   : 9
    <909>   DW_AT_decl_line   : 44
    <90a>   DW_AT_decl_column : 6
    <90b>   DW_AT_prototyped  : 1
    <90b>   DW_AT_declaration : 1
 <1><90b>: Abbrev Number: 27 (DW_TAG_subprogram)
    <90c>   DW_AT_external    : 1
    <90c>   DW_AT_name        : (indirect string, offset: 0xab250): BSP_GetTick
    <910>   DW_AT_decl_file   : 1
    <911>   DW_AT_decl_line   : 42
    <912>   DW_AT_decl_column : 9
    <913>   DW_AT_prototyped  : 1
    <913>   DW_AT_type        : <0xbc>
    <917>   DW_AT_low_pc      : 0x800031c
    <91b>   DW_AT_high_pc     : 0xe
    <91f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <921>   DW_AT_GNU_all_tail_call_sites: 1
 <1><921>: Abbrev Number: 28 (DW_TAG_subprogram)
    <922>   DW_AT_external    : 1
    <922>   DW_AT_name        : (indirect string, offset: 0x2dcdb): BSP_I2C1_ReadReg16
    <926>   DW_AT_decl_file   : 1
    <927>   DW_AT_decl_line   : 37
    <928>   DW_AT_decl_column : 9
    <929>   DW_AT_prototyped  : 1
    <929>   DW_AT_type        : <0xbc>
    <92d>   DW_AT_low_pc      : 0x80002d8
    <931>   DW_AT_high_pc     : 0x44
    <935>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <937>   DW_AT_GNU_all_tail_call_sites: 1
    <937>   DW_AT_sibling     : <0x987>
 <2><93b>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <93c>   DW_AT_name        : (indirect string, offset: 0x14652e): Address
    <940>   DW_AT_decl_file   : 1
    <941>   DW_AT_decl_line   : 37
    <942>   DW_AT_decl_column : 37
    <943>   DW_AT_type        : <0xab>
    <947>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><94a>: Abbrev Number: 30 (DW_TAG_formal_parameter)
    <94b>   DW_AT_name        : Reg
    <94f>   DW_AT_decl_file   : 1
    <950>   DW_AT_decl_line   : 37
    <951>   DW_AT_decl_column : 55
    <952>   DW_AT_type        : <0xab>
    <956>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><959>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <95a>   DW_AT_name        : (indirect string, offset: 0xffe48): pData
    <95e>   DW_AT_decl_file   : 1
    <95f>   DW_AT_decl_line   : 37
    <960>   DW_AT_decl_column : 69
    <961>   DW_AT_type        : <0x82b>
    <965>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><968>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <969>   DW_AT_name        : (indirect string, offset: 0x150a49): Length
    <96d>   DW_AT_decl_file   : 1
    <96e>   DW_AT_decl_line   : 37
    <96f>   DW_AT_decl_column : 85
    <970>   DW_AT_type        : <0xab>
    <974>   DW_AT_location    : 2 byte block: 91 66 	(DW_OP_fbreg: -26)
 <2><977>: Abbrev Number: 31 (DW_TAG_variable)
    <978>   DW_AT_name        : ret
    <97c>   DW_AT_decl_file   : 1
    <97d>   DW_AT_decl_line   : 38
    <97e>   DW_AT_decl_column : 13
    <97f>   DW_AT_type        : <0xbc>
    <983>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><986>: Abbrev Number: 0
 <1><987>: Abbrev Number: 28 (DW_TAG_subprogram)
    <988>   DW_AT_external    : 1
    <988>   DW_AT_name        : (indirect string, offset: 0xdf9f0): BSP_I2C1_WriteReg16
    <98c>   DW_AT_decl_file   : 1
    <98d>   DW_AT_decl_line   : 32
    <98e>   DW_AT_decl_column : 9
    <98f>   DW_AT_prototyped  : 1
    <98f>   DW_AT_type        : <0xbc>
    <993>   DW_AT_low_pc      : 0x8000294
    <997>   DW_AT_high_pc     : 0x44
    <99b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <99d>   DW_AT_GNU_all_tail_call_sites: 1
    <99d>   DW_AT_sibling     : <0x9ed>
 <2><9a1>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <9a2>   DW_AT_name        : (indirect string, offset: 0x14652e): Address
    <9a6>   DW_AT_decl_file   : 1
    <9a7>   DW_AT_decl_line   : 32
    <9a8>   DW_AT_decl_column : 38
    <9a9>   DW_AT_type        : <0xab>
    <9ad>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><9b0>: Abbrev Number: 30 (DW_TAG_formal_parameter)
    <9b1>   DW_AT_name        : Reg
    <9b5>   DW_AT_decl_file   : 1
    <9b6>   DW_AT_decl_line   : 32
    <9b7>   DW_AT_decl_column : 56
    <9b8>   DW_AT_type        : <0xab>
    <9bc>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><9bf>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <9c0>   DW_AT_name        : (indirect string, offset: 0xffe48): pData
    <9c4>   DW_AT_decl_file   : 1
    <9c5>   DW_AT_decl_line   : 32
    <9c6>   DW_AT_decl_column : 70
    <9c7>   DW_AT_type        : <0x82b>
    <9cb>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><9ce>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x150a49): Length
    <9d3>   DW_AT_decl_file   : 1
    <9d4>   DW_AT_decl_line   : 32
    <9d5>   DW_AT_decl_column : 86
    <9d6>   DW_AT_type        : <0xab>
    <9da>   DW_AT_location    : 2 byte block: 91 66 	(DW_OP_fbreg: -26)
 <2><9dd>: Abbrev Number: 31 (DW_TAG_variable)
    <9de>   DW_AT_name        : ret
    <9e2>   DW_AT_decl_file   : 1
    <9e3>   DW_AT_decl_line   : 33
    <9e4>   DW_AT_decl_column : 13
    <9e5>   DW_AT_type        : <0xbc>
    <9e9>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><9ec>: Abbrev Number: 0
 <1><9ed>: Abbrev Number: 28 (DW_TAG_subprogram)
    <9ee>   DW_AT_external    : 1
    <9ee>   DW_AT_name        : (indirect string, offset: 0xdc47): BSP_I2C1_ReadReg
    <9f2>   DW_AT_decl_file   : 1
    <9f3>   DW_AT_decl_line   : 27
    <9f4>   DW_AT_decl_column : 9
    <9f5>   DW_AT_prototyped  : 1
    <9f5>   DW_AT_type        : <0xbc>
    <9f9>   DW_AT_low_pc      : 0x0
    <9fd>   DW_AT_high_pc     : 0x44
    <a01>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a03>   DW_AT_GNU_all_tail_call_sites: 1
    <a03>   DW_AT_sibling     : <0xa53>
 <2><a07>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <a08>   DW_AT_name        : (indirect string, offset: 0x14652e): Address
    <a0c>   DW_AT_decl_file   : 1
    <a0d>   DW_AT_decl_line   : 27
    <a0e>   DW_AT_decl_column : 35
    <a0f>   DW_AT_type        : <0xab>
    <a13>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><a16>: Abbrev Number: 30 (DW_TAG_formal_parameter)
    <a17>   DW_AT_name        : Reg
    <a1b>   DW_AT_decl_file   : 1
    <a1c>   DW_AT_decl_line   : 27
    <a1d>   DW_AT_decl_column : 53
    <a1e>   DW_AT_type        : <0xab>
    <a22>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><a25>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <a26>   DW_AT_name        : (indirect string, offset: 0xffe48): pData
    <a2a>   DW_AT_decl_file   : 1
    <a2b>   DW_AT_decl_line   : 27
    <a2c>   DW_AT_decl_column : 67
    <a2d>   DW_AT_type        : <0x82b>
    <a31>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><a34>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <a35>   DW_AT_name        : (indirect string, offset: 0x150a49): Length
    <a39>   DW_AT_decl_file   : 1
    <a3a>   DW_AT_decl_line   : 27
    <a3b>   DW_AT_decl_column : 83
    <a3c>   DW_AT_type        : <0xab>
    <a40>   DW_AT_location    : 2 byte block: 91 66 	(DW_OP_fbreg: -26)
 <2><a43>: Abbrev Number: 31 (DW_TAG_variable)
    <a44>   DW_AT_name        : ret
    <a48>   DW_AT_decl_file   : 1
    <a49>   DW_AT_decl_line   : 28
    <a4a>   DW_AT_decl_column : 13
    <a4b>   DW_AT_type        : <0xbc>
    <a4f>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a52>: Abbrev Number: 0
 <1><a53>: Abbrev Number: 28 (DW_TAG_subprogram)
    <a54>   DW_AT_external    : 1
    <a54>   DW_AT_name        : (indirect string, offset: 0xe731a): BSP_I2C1_WriteReg
    <a58>   DW_AT_decl_file   : 1
    <a59>   DW_AT_decl_line   : 22
    <a5a>   DW_AT_decl_column : 9
    <a5b>   DW_AT_prototyped  : 1
    <a5b>   DW_AT_type        : <0xbc>
    <a5f>   DW_AT_low_pc      : 0x0
    <a63>   DW_AT_high_pc     : 0x44
    <a67>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a69>   DW_AT_GNU_all_tail_call_sites: 1
    <a69>   DW_AT_sibling     : <0xab9>
 <2><a6d>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <a6e>   DW_AT_name        : (indirect string, offset: 0x14652e): Address
    <a72>   DW_AT_decl_file   : 1
    <a73>   DW_AT_decl_line   : 22
    <a74>   DW_AT_decl_column : 36
    <a75>   DW_AT_type        : <0xab>
    <a79>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><a7c>: Abbrev Number: 30 (DW_TAG_formal_parameter)
    <a7d>   DW_AT_name        : Reg
    <a81>   DW_AT_decl_file   : 1
    <a82>   DW_AT_decl_line   : 22
    <a83>   DW_AT_decl_column : 54
    <a84>   DW_AT_type        : <0xab>
    <a88>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><a8b>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <a8c>   DW_AT_name        : (indirect string, offset: 0xffe48): pData
    <a90>   DW_AT_decl_file   : 1
    <a91>   DW_AT_decl_line   : 22
    <a92>   DW_AT_decl_column : 68
    <a93>   DW_AT_type        : <0x82b>
    <a97>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><a9a>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <a9b>   DW_AT_name        : (indirect string, offset: 0x150a49): Length
    <a9f>   DW_AT_decl_file   : 1
    <aa0>   DW_AT_decl_line   : 22
    <aa1>   DW_AT_decl_column : 84
    <aa2>   DW_AT_type        : <0xab>
    <aa6>   DW_AT_location    : 2 byte block: 91 66 	(DW_OP_fbreg: -26)
 <2><aa9>: Abbrev Number: 31 (DW_TAG_variable)
    <aaa>   DW_AT_name        : ret
    <aae>   DW_AT_decl_file   : 1
    <aaf>   DW_AT_decl_line   : 23
    <ab0>   DW_AT_decl_column : 13
    <ab1>   DW_AT_type        : <0xbc>
    <ab5>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><ab8>: Abbrev Number: 0
 <1><ab9>: Abbrev Number: 32 (DW_TAG_subprogram)
    <aba>   DW_AT_external    : 1
    <aba>   DW_AT_name        : (indirect string, offset: 0x12ff02): BSP_I2C1_DeInit
    <abe>   DW_AT_decl_file   : 1
    <abf>   DW_AT_decl_line   : 18
    <ac0>   DW_AT_decl_column : 6
    <ac1>   DW_AT_prototyped  : 1
    <ac1>   DW_AT_low_pc      : 0x8000280
    <ac5>   DW_AT_high_pc     : 0x14
    <ac9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <acb>   DW_AT_GNU_all_tail_call_sites: 1
 <1><acb>: Abbrev Number: 32 (DW_TAG_subprogram)
    <acc>   DW_AT_external    : 1
    <acc>   DW_AT_name        : (indirect string, offset: 0xa4845): BSP_I2C1_Init
    <ad0>   DW_AT_decl_file   : 1
    <ad1>   DW_AT_decl_line   : 14
    <ad2>   DW_AT_decl_column : 6
    <ad3>   DW_AT_prototyped  : 1
    <ad3>   DW_AT_low_pc      : 0x8000274
    <ad7>   DW_AT_high_pc     : 0xc
    <adb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <add>   DW_AT_GNU_all_tail_call_sites: 1
 <1><add>: Abbrev Number: 0
  Compilation Unit @ offset 0xade:
   Length:        0xc4e (32-bit)
   Version:       4
   Abbrev Offset: 0x1fb
   Pointer Size:  4
 <0><ae9>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <aea>   DW_AT_producer    : (indirect string, offset: 0x59b0f): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m33 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv8-m.main+dsp+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <aee>   DW_AT_language    : 12	(ANSI C99)
    <aef>   DW_AT_name        : (indirect string, offset: 0x144868): ../Core/Src/BoardSupportPackage/BSP_camera.c
    <af3>   DW_AT_comp_dir    : (indirect string, offset: 0x1091c4): C:/Users/evanl/OneDrive/Documents/Embedded_Software_Workspaces/ExampleCode/SurveillanceSystem/Debug
    <af7>   DW_AT_ranges      : 0x40
    <afb>   DW_AT_low_pc      : 0x0
    <aff>   DW_AT_stmt_list   : 0x924
    <b03>   DW_AT_GNU_macros  : 0x30e54
 <1><b07>: Abbrev Number: 2 (DW_TAG_base_type)
    <b08>   DW_AT_byte_size   : 1
    <b09>   DW_AT_encoding    : 6	(signed char)
    <b0a>   DW_AT_name        : (indirect string, offset: 0x115941): signed char
 <1><b0e>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0f>   DW_AT_name        : (indirect string, offset: 0xaf3ef): __uint8_t
    <b13>   DW_AT_decl_file   : 2
    <b14>   DW_AT_decl_line   : 43
    <b15>   DW_AT_decl_column : 24
    <b16>   DW_AT_type        : <0xb1a>
 <1><b1a>: Abbrev Number: 2 (DW_TAG_base_type)
    <b1b>   DW_AT_byte_size   : 1
    <b1c>   DW_AT_encoding    : 8	(unsigned char)
    <b1d>   DW_AT_name        : (indirect string, offset: 0x7d2c4): unsigned char
 <1><b21>: Abbrev Number: 2 (DW_TAG_base_type)
    <b22>   DW_AT_byte_size   : 2
    <b23>   DW_AT_encoding    : 5	(signed)
    <b24>   DW_AT_name        : (indirect string, offset: 0x8897d): short int
 <1><b28>: Abbrev Number: 3 (DW_TAG_typedef)
    <b29>   DW_AT_name        : (indirect string, offset: 0x96cfa): __uint16_t
    <b2d>   DW_AT_decl_file   : 2
    <b2e>   DW_AT_decl_line   : 57
    <b2f>   DW_AT_decl_column : 25
    <b30>   DW_AT_type        : <0xb34>
 <1><b34>: Abbrev Number: 2 (DW_TAG_base_type)
    <b35>   DW_AT_byte_size   : 2
    <b36>   DW_AT_encoding    : 7	(unsigned)
    <b37>   DW_AT_name        : (indirect string, offset: 0x5ea4b): short unsigned int
 <1><b3b>: Abbrev Number: 3 (DW_TAG_typedef)
    <b3c>   DW_AT_name        : (indirect string, offset: 0x9c951): __int32_t
    <b40>   DW_AT_decl_file   : 2
    <b41>   DW_AT_decl_line   : 77
    <b42>   DW_AT_decl_column : 24
    <b43>   DW_AT_type        : <0xb47>
 <1><b47>: Abbrev Number: 2 (DW_TAG_base_type)
    <b48>   DW_AT_byte_size   : 4
    <b49>   DW_AT_encoding    : 5	(signed)
    <b4a>   DW_AT_name        : (indirect string, offset: 0x114ba1): long int
 <1><b4e>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4f>   DW_AT_name        : (indirect string, offset: 0x127c4): __uint32_t
    <b53>   DW_AT_decl_file   : 2
    <b54>   DW_AT_decl_line   : 79
    <b55>   DW_AT_decl_column : 25
    <b56>   DW_AT_type        : <0xb5a>
 <1><b5a>: Abbrev Number: 2 (DW_TAG_base_type)
    <b5b>   DW_AT_byte_size   : 4
    <b5c>   DW_AT_encoding    : 7	(unsigned)
    <b5d>   DW_AT_name        : (indirect string, offset: 0xcd5fe): long unsigned int
 <1><b61>: Abbrev Number: 2 (DW_TAG_base_type)
    <b62>   DW_AT_byte_size   : 8
    <b63>   DW_AT_encoding    : 5	(signed)
    <b64>   DW_AT_name        : (indirect string, offset: 0x9671): long long int
 <1><b68>: Abbrev Number: 2 (DW_TAG_base_type)
    <b69>   DW_AT_byte_size   : 8
    <b6a>   DW_AT_encoding    : 7	(unsigned)
    <b6b>   DW_AT_name        : (indirect string, offset: 0xa6647): long long unsigned int
 <1><b6f>: Abbrev Number: 4 (DW_TAG_base_type)
    <b70>   DW_AT_byte_size   : 4
    <b71>   DW_AT_encoding    : 5	(signed)
    <b72>   DW_AT_name        : int
 <1><b76>: Abbrev Number: 2 (DW_TAG_base_type)
    <b77>   DW_AT_byte_size   : 4
    <b78>   DW_AT_encoding    : 7	(unsigned)
    <b79>   DW_AT_name        : (indirect string, offset: 0x96dbf): unsigned int
 <1><b7d>: Abbrev Number: 3 (DW_TAG_typedef)
    <b7e>   DW_AT_name        : (indirect string, offset: 0xaf3f1): uint8_t
    <b82>   DW_AT_decl_file   : 3
    <b83>   DW_AT_decl_line   : 24
    <b84>   DW_AT_decl_column : 19
    <b85>   DW_AT_type        : <0xb0e>
 <1><b89>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8a>   DW_AT_name        : (indirect string, offset: 0x96cfc): uint16_t
    <b8e>   DW_AT_decl_file   : 3
    <b8f>   DW_AT_decl_line   : 36
    <b90>   DW_AT_decl_column : 20
    <b91>   DW_AT_type        : <0xb28>
 <1><b95>: Abbrev Number: 3 (DW_TAG_typedef)
    <b96>   DW_AT_name        : (indirect string, offset: 0x9c953): int32_t
    <b9a>   DW_AT_decl_file   : 3
    <b9b>   DW_AT_decl_line   : 44
    <b9c>   DW_AT_decl_column : 19
    <b9d>   DW_AT_type        : <0xb3b>
 <1><ba1>: Abbrev Number: 3 (DW_TAG_typedef)
    <ba2>   DW_AT_name        : (indirect string, offset: 0x127c6): uint32_t
    <ba6>   DW_AT_decl_file   : 3
    <ba7>   DW_AT_decl_line   : 48
    <ba8>   DW_AT_decl_column : 20
    <ba9>   DW_AT_type        : <0xb4e>
 <1><bad>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <bae>   DW_AT_type        : <0xba1>
 <1><bb2>: Abbrev Number: 6 (DW_TAG_enumeration_type)
    <bb3>   DW_AT_encoding    : 7	(unsigned)
    <bb4>   DW_AT_byte_size   : 1
    <bb5>   DW_AT_type        : <0xb1a>
    <bb9>   DW_AT_decl_file   : 4
    <bba>   DW_AT_decl_line   : 12
    <bbb>   DW_AT_decl_column : 14
    <bbc>   DW_AT_sibling     : <0xbd9>
 <2><bc0>: Abbrev Number: 7 (DW_TAG_enumerator)
    <bc1>   DW_AT_name        : (indirect string, offset: 0x1452f1): CameraOK
    <bc5>   DW_AT_const_value : 0
 <2><bc6>: Abbrev Number: 7 (DW_TAG_enumerator)
    <bc7>   DW_AT_name        : (indirect string, offset: 0x1458c3): CameraParamErr
    <bcb>   DW_AT_const_value : 1
 <2><bcc>: Abbrev Number: 7 (DW_TAG_enumerator)
    <bcd>   DW_AT_name        : (indirect string, offset: 0x145125): CameraPeripheralCommErr
    <bd1>   DW_AT_const_value : 2
 <2><bd2>: Abbrev Number: 7 (DW_TAG_enumerator)
    <bd3>   DW_AT_name        : (indirect string, offset: 0x14385c): CameraTimeoutErr
    <bd7>   DW_AT_const_value : 4
 <2><bd8>: Abbrev Number: 0
 <1><bd9>: Abbrev Number: 3 (DW_TAG_typedef)
    <bda>   DW_AT_name        : (indirect string, offset: 0x14316b): BSP_CameraStatus_t
    <bde>   DW_AT_decl_file   : 4
    <bdf>   DW_AT_decl_line   : 17
    <be0>   DW_AT_decl_column : 2
    <be1>   DW_AT_type        : <0xbb2>
 <1><be5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <be6>   DW_AT_byte_size   : 24
    <be7>   DW_AT_decl_file   : 5
    <be8>   DW_AT_decl_line   : 9
    <be9>   DW_AT_decl_column : 9
    <bea>   DW_AT_sibling     : <0xc3d>
 <2><bee>: Abbrev Number: 9 (DW_TAG_member)
    <bef>   DW_AT_name        : (indirect string, offset: 0x14652e): Address
    <bf3>   DW_AT_decl_file   : 5
    <bf4>   DW_AT_decl_line   : 10
    <bf5>   DW_AT_decl_column : 11
    <bf6>   DW_AT_type        : <0xb89>
    <bfa>   DW_AT_data_member_location: 0
 <2><bfb>: Abbrev Number: 9 (DW_TAG_member)
    <bfc>   DW_AT_name        : (indirect string, offset: 0x14e4f5): Init
    <c00>   DW_AT_decl_file   : 5
    <c01>   DW_AT_decl_line   : 11
    <c02>   DW_AT_decl_column : 15
    <c03>   DW_AT_type        : <0xc3e>
    <c07>   DW_AT_data_member_location: 4
 <2><c08>: Abbrev Number: 9 (DW_TAG_member)
    <c09>   DW_AT_name        : (indirect string, offset: 0x12ff0b): DeInit
    <c0d>   DW_AT_decl_file   : 5
    <c0e>   DW_AT_decl_line   : 12
    <c0f>   DW_AT_decl_column : 15
    <c10>   DW_AT_type        : <0xc3e>
    <c14>   DW_AT_data_member_location: 8
 <2><c15>: Abbrev Number: 9 (DW_TAG_member)
    <c16>   DW_AT_name        : (indirect string, offset: 0xd7b87): Write
    <c1a>   DW_AT_decl_file   : 5
    <c1b>   DW_AT_decl_line   : 13
    <c1c>   DW_AT_decl_column : 15
    <c1d>   DW_AT_type        : <0xc68>
    <c21>   DW_AT_data_member_location: 12
 <2><c22>: Abbrev Number: 9 (DW_TAG_member)
    <c23>   DW_AT_name        : (indirect string, offset: 0x9679f): Read
    <c27>   DW_AT_decl_file   : 5
    <c28>   DW_AT_decl_line   : 14
    <c29>   DW_AT_decl_column : 15
    <c2a>   DW_AT_type        : <0xc68>
    <c2e>   DW_AT_data_member_location: 16
 <2><c2f>: Abbrev Number: 9 (DW_TAG_member)
    <c30>   DW_AT_name        : (indirect string, offset: 0x28406): GetTick
    <c34>   DW_AT_decl_file   : 5
    <c35>   DW_AT_decl_line   : 15
    <c36>   DW_AT_decl_column : 15
    <c37>   DW_AT_type        : <0xc73>
    <c3b>   DW_AT_data_member_location: 20
 <2><c3c>: Abbrev Number: 0
 <1><c3d>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <c3e>   DW_AT_prototyped  : 1
 <1><c3e>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <c3f>   DW_AT_byte_size   : 4
    <c40>   DW_AT_type        : <0xc3d>
 <1><c44>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <c45>   DW_AT_prototyped  : 1
    <c45>   DW_AT_type        : <0xb95>
    <c49>   DW_AT_sibling     : <0xc62>
 <2><c4d>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <c4e>   DW_AT_type        : <0xb89>
 <2><c52>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <c53>   DW_AT_type        : <0xb89>
 <2><c57>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <c58>   DW_AT_type        : <0xc62>
 <2><c5c>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <c5d>   DW_AT_type        : <0xb89>
 <2><c61>: Abbrev Number: 0
 <1><c62>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <c63>   DW_AT_byte_size   : 4
    <c64>   DW_AT_type        : <0xb7d>
 <1><c68>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <c69>   DW_AT_byte_size   : 4
    <c6a>   DW_AT_type        : <0xc44>
 <1><c6e>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <c6f>   DW_AT_prototyped  : 1
    <c6f>   DW_AT_type        : <0xb95>
 <1><c73>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <c74>   DW_AT_byte_size   : 4
    <c75>   DW_AT_type        : <0xc6e>
 <1><c79>: Abbrev Number: 3 (DW_TAG_typedef)
    <c7a>   DW_AT_name        : (indirect string, offset: 0x145926): OV5640_IO_t
    <c7e>   DW_AT_decl_file   : 5
    <c7f>   DW_AT_decl_line   : 16
    <c80>   DW_AT_decl_column : 2
    <c81>   DW_AT_type        : <0xbe5>
 <1><c85>: Abbrev Number: 8 (DW_TAG_structure_type)
    <c86>   DW_AT_byte_size   : 12
    <c87>   DW_AT_decl_file   : 5
    <c88>   DW_AT_decl_line   : 18
    <c89>   DW_AT_decl_column : 9
    <c8a>   DW_AT_sibling     : <0xcb6>
 <2><c8e>: Abbrev Number: 9 (DW_TAG_member)
    <c8f>   DW_AT_name        : (indirect string, offset: 0xd7b87): Write
    <c93>   DW_AT_decl_file   : 5
    <c94>   DW_AT_decl_line   : 19
    <c95>   DW_AT_decl_column : 15
    <c96>   DW_AT_type        : <0xcd6>
    <c9a>   DW_AT_data_member_location: 0
 <2><c9b>: Abbrev Number: 9 (DW_TAG_member)
    <c9c>   DW_AT_name        : (indirect string, offset: 0x9679f): Read
    <ca0>   DW_AT_decl_file   : 5
    <ca1>   DW_AT_decl_line   : 20
    <ca2>   DW_AT_decl_column : 15
    <ca3>   DW_AT_type        : <0xcd6>
    <ca7>   DW_AT_data_member_location: 4
 <2><ca8>: Abbrev Number: 9 (DW_TAG_member)
    <ca9>   DW_AT_name        : (indirect string, offset: 0x14342c): Handle
    <cad>   DW_AT_decl_file   : 5
    <cae>   DW_AT_decl_line   : 21
    <caf>   DW_AT_decl_column : 11
    <cb0>   DW_AT_type        : <0xcd4>
    <cb4>   DW_AT_data_member_location: 8
 <2><cb5>: Abbrev Number: 0
 <1><cb6>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <cb7>   DW_AT_prototyped  : 1
    <cb7>   DW_AT_type        : <0xb95>
    <cbb>   DW_AT_sibling     : <0xcd4>
 <2><cbf>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <cc0>   DW_AT_type        : <0xcd4>
 <2><cc4>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <cc5>   DW_AT_type        : <0xb89>
 <2><cc9>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <cca>   DW_AT_type        : <0xc62>
 <2><cce>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <ccf>   DW_AT_type        : <0xb89>
 <2><cd3>: Abbrev Number: 0
 <1><cd4>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <cd5>   DW_AT_byte_size   : 4
 <1><cd6>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <cd7>   DW_AT_byte_size   : 4
    <cd8>   DW_AT_type        : <0xcb6>
 <1><cdc>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdd>   DW_AT_name        : (indirect string, offset: 0x144a13): OV5650_Context_t
    <ce1>   DW_AT_decl_file   : 5
    <ce2>   DW_AT_decl_line   : 22
    <ce3>   DW_AT_decl_column : 2
    <ce4>   DW_AT_type        : <0xc85>
 <1><ce8>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ce9>   DW_AT_byte_size   : 36
    <cea>   DW_AT_decl_file   : 5
    <ceb>   DW_AT_decl_line   : 24
    <cec>   DW_AT_decl_column : 9
    <ced>   DW_AT_sibling     : <0xd0b>
 <2><cf1>: Abbrev Number: 16 (DW_TAG_member)
    <cf2>   DW_AT_name        : IO
    <cf5>   DW_AT_decl_file   : 5
    <cf6>   DW_AT_decl_line   : 25
    <cf7>   DW_AT_decl_column : 14
    <cf8>   DW_AT_type        : <0xc79>
    <cfc>   DW_AT_data_member_location: 0
 <2><cfd>: Abbrev Number: 9 (DW_TAG_member)
    <cfe>   DW_AT_name        : (indirect string, offset: 0x1449d0): Context
    <d02>   DW_AT_decl_file   : 5
    <d03>   DW_AT_decl_line   : 26
    <d04>   DW_AT_decl_column : 19
    <d05>   DW_AT_type        : <0xcdc>
    <d09>   DW_AT_data_member_location: 24
 <2><d0a>: Abbrev Number: 0
 <1><d0b>: Abbrev Number: 3 (DW_TAG_typedef)
    <d0c>   DW_AT_name        : (indirect string, offset: 0x1418d8): OV5640_Handle_t
    <d10>   DW_AT_decl_file   : 5
    <d11>   DW_AT_decl_line   : 27
    <d12>   DW_AT_decl_column : 2
    <d13>   DW_AT_type        : <0xce8>
 <1><d17>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <d18>   DW_AT_byte_size   : 4
    <d19>   DW_AT_type        : <0xd0b>
 <1><d1d>: Abbrev Number: 17 (DW_TAG_array_type)
    <d1e>   DW_AT_type        : <0xba1>
    <d22>   DW_AT_sibling     : <0xd2d>
 <2><d26>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <d27>   DW_AT_type        : <0xb76>
    <d2b>   DW_AT_upper_bound : 1
 <2><d2c>: Abbrev Number: 0
 <1><d2d>: Abbrev Number: 17 (DW_TAG_array_type)
    <d2e>   DW_AT_type        : <0xba1>
    <d32>   DW_AT_sibling     : <0xd3d>
 <2><d36>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <d37>   DW_AT_type        : <0xb76>
    <d3b>   DW_AT_upper_bound : 7
 <2><d3c>: Abbrev Number: 0
 <1><d3d>: Abbrev Number: 17 (DW_TAG_array_type)
    <d3e>   DW_AT_type        : <0xbad>
    <d42>   DW_AT_sibling     : <0xd4d>
 <2><d46>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <d47>   DW_AT_type        : <0xb76>
    <d4b>   DW_AT_upper_bound : 1
 <2><d4c>: Abbrev Number: 0
 <1><d4d>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <d4e>   DW_AT_type        : <0xd3d>
 <1><d52>: Abbrev Number: 19 (DW_TAG_structure_type)
    <d53>   DW_AT_byte_size   : 44
    <d54>   DW_AT_decl_file   : 6
    <d55>   DW_AT_decl_line   : 414
    <d57>   DW_AT_decl_column : 9
    <d58>   DW_AT_sibling     : <0xdf4>
 <2><d5c>: Abbrev Number: 20 (DW_TAG_member)
    <d5d>   DW_AT_name        : CR
    <d60>   DW_AT_decl_file   : 6
    <d61>   DW_AT_decl_line   : 416
    <d63>   DW_AT_decl_column : 17
    <d64>   DW_AT_type        : <0xbad>
    <d68>   DW_AT_data_member_location: 0
 <2><d69>: Abbrev Number: 20 (DW_TAG_member)
    <d6a>   DW_AT_name        : SR
    <d6d>   DW_AT_decl_file   : 6
    <d6e>   DW_AT_decl_line   : 417
    <d70>   DW_AT_decl_column : 17
    <d71>   DW_AT_type        : <0xbad>
    <d75>   DW_AT_data_member_location: 4
 <2><d76>: Abbrev Number: 21 (DW_TAG_member)
    <d77>   DW_AT_name        : (indirect string, offset: 0x1450cc): RISR
    <d7b>   DW_AT_decl_file   : 6
    <d7c>   DW_AT_decl_line   : 418
    <d7e>   DW_AT_decl_column : 17
    <d7f>   DW_AT_type        : <0xbad>
    <d83>   DW_AT_data_member_location: 8
 <2><d84>: Abbrev Number: 20 (DW_TAG_member)
    <d85>   DW_AT_name        : IER
    <d89>   DW_AT_decl_file   : 6
    <d8a>   DW_AT_decl_line   : 419
    <d8c>   DW_AT_decl_column : 17
    <d8d>   DW_AT_type        : <0xbad>
    <d91>   DW_AT_data_member_location: 12
 <2><d92>: Abbrev Number: 21 (DW_TAG_member)
    <d93>   DW_AT_name        : (indirect string, offset: 0x1494cc): MISR
    <d97>   DW_AT_decl_file   : 6
    <d98>   DW_AT_decl_line   : 420
    <d9a>   DW_AT_decl_column : 17
    <d9b>   DW_AT_type        : <0xbad>
    <d9f>   DW_AT_data_member_location: 16
 <2><da0>: Abbrev Number: 20 (DW_TAG_member)
    <da1>   DW_AT_name        : ICR
    <da5>   DW_AT_decl_file   : 6
    <da6>   DW_AT_decl_line   : 421
    <da8>   DW_AT_decl_column : 17
    <da9>   DW_AT_type        : <0xbad>
    <dad>   DW_AT_data_member_location: 20
 <2><dae>: Abbrev Number: 21 (DW_TAG_member)
    <daf>   DW_AT_name        : (indirect string, offset: 0x144f96): ESCR
    <db3>   DW_AT_decl_file   : 6
    <db4>   DW_AT_decl_line   : 422
    <db6>   DW_AT_decl_column : 17
    <db7>   DW_AT_type        : <0xbad>
    <dbb>   DW_AT_data_member_location: 24
 <2><dbc>: Abbrev Number: 21 (DW_TAG_member)
    <dbd>   DW_AT_name        : (indirect string, offset: 0x145774): ESUR
    <dc1>   DW_AT_decl_file   : 6
    <dc2>   DW_AT_decl_line   : 423
    <dc4>   DW_AT_decl_column : 17
    <dc5>   DW_AT_type        : <0xbad>
    <dc9>   DW_AT_data_member_location: 28
 <2><dca>: Abbrev Number: 21 (DW_TAG_member)
    <dcb>   DW_AT_name        : (indirect string, offset: 0x145204): CWSTRTR
    <dcf>   DW_AT_decl_file   : 6
    <dd0>   DW_AT_decl_line   : 424
    <dd2>   DW_AT_decl_column : 17
    <dd3>   DW_AT_type        : <0xbad>
    <dd7>   DW_AT_data_member_location: 32
 <2><dd8>: Abbrev Number: 21 (DW_TAG_member)
    <dd9>   DW_AT_name        : (indirect string, offset: 0x145584): CWSIZER
    <ddd>   DW_AT_decl_file   : 6
    <dde>   DW_AT_decl_line   : 425
    <de0>   DW_AT_decl_column : 17
    <de1>   DW_AT_type        : <0xbad>
    <de5>   DW_AT_data_member_location: 36
 <2><de6>: Abbrev Number: 20 (DW_TAG_member)
    <de7>   DW_AT_name        : DR
    <dea>   DW_AT_decl_file   : 6
    <deb>   DW_AT_decl_line   : 426
    <ded>   DW_AT_decl_column : 17
    <dee>   DW_AT_type        : <0xbad>
    <df2>   DW_AT_data_member_location: 40
 <2><df3>: Abbrev Number: 0
 <1><df4>: Abbrev Number: 22 (DW_TAG_typedef)
    <df5>   DW_AT_name        : (indirect string, offset: 0x1423ca): DCMI_TypeDef
    <df9>   DW_AT_decl_file   : 6
    <dfa>   DW_AT_decl_line   : 427
    <dfc>   DW_AT_decl_column : 3
    <dfd>   DW_AT_type        : <0xd52>
 <1><e01>: Abbrev Number: 19 (DW_TAG_structure_type)
    <e02>   DW_AT_byte_size   : 128
    <e03>   DW_AT_decl_file   : 6
    <e04>   DW_AT_decl_line   : 441
    <e06>   DW_AT_decl_column : 9
    <e07>   DW_AT_sibling     : <0xede>
 <2><e0b>: Abbrev Number: 21 (DW_TAG_member)
    <e0c>   DW_AT_name        : (indirect string, offset: 0xb4034): CLBAR
    <e10>   DW_AT_decl_file   : 6
    <e11>   DW_AT_decl_line   : 443
    <e13>   DW_AT_decl_column : 17
    <e14>   DW_AT_type        : <0xbad>
    <e18>   DW_AT_data_member_location: 0
 <2><e19>: Abbrev Number: 21 (DW_TAG_member)
    <e1a>   DW_AT_name        : (indirect string, offset: 0x644c1): RESERVED1
    <e1e>   DW_AT_decl_file   : 6
    <e1f>   DW_AT_decl_line   : 444
    <e21>   DW_AT_decl_column : 17
    <e22>   DW_AT_type        : <0xd1d>
    <e26>   DW_AT_data_member_location: 4
 <2><e27>: Abbrev Number: 21 (DW_TAG_member)
    <e28>   DW_AT_name        : (indirect string, offset: 0x114302): CFCR
    <e2c>   DW_AT_decl_file   : 6
    <e2d>   DW_AT_decl_line   : 445
    <e2f>   DW_AT_decl_column : 17
    <e30>   DW_AT_type        : <0xbad>
    <e34>   DW_AT_data_member_location: 12
 <2><e35>: Abbrev Number: 20 (DW_TAG_member)
    <e36>   DW_AT_name        : CSR
    <e3a>   DW_AT_decl_file   : 6
    <e3b>   DW_AT_decl_line   : 446
    <e3d>   DW_AT_decl_column : 17
    <e3e>   DW_AT_type        : <0xbad>
    <e42>   DW_AT_data_member_location: 16
 <2><e43>: Abbrev Number: 20 (DW_TAG_member)
    <e44>   DW_AT_name        : CCR
    <e48>   DW_AT_decl_file   : 6
    <e49>   DW_AT_decl_line   : 447
    <e4b>   DW_AT_decl_column : 17
    <e4c>   DW_AT_type        : <0xbad>
    <e50>   DW_AT_data_member_location: 20
 <2><e51>: Abbrev Number: 21 (DW_TAG_member)
    <e52>   DW_AT_name        : (indirect string, offset: 0x644cb): RESERVED2
    <e56>   DW_AT_decl_file   : 6
    <e57>   DW_AT_decl_line   : 448
    <e59>   DW_AT_decl_column : 17
    <e5a>   DW_AT_type        : <0xede>
    <e5e>   DW_AT_data_member_location: 24
 <2><e5f>: Abbrev Number: 21 (DW_TAG_member)
    <e60>   DW_AT_name        : (indirect string, offset: 0x10bf16): CTR1
    <e64>   DW_AT_decl_file   : 6
    <e65>   DW_AT_decl_line   : 449
    <e67>   DW_AT_decl_column : 17
    <e68>   DW_AT_type        : <0xbad>
    <e6c>   DW_AT_data_member_location: 64
 <2><e6d>: Abbrev Number: 21 (DW_TAG_member)
    <e6e>   DW_AT_name        : (indirect string, offset: 0x10bf1b): CTR2
    <e72>   DW_AT_decl_file   : 6
    <e73>   DW_AT_decl_line   : 450
    <e75>   DW_AT_decl_column : 17
    <e76>   DW_AT_type        : <0xbad>
    <e7a>   DW_AT_data_member_location: 68
 <2><e7b>: Abbrev Number: 21 (DW_TAG_member)
    <e7c>   DW_AT_name        : (indirect string, offset: 0xc0f11): CBR1
    <e80>   DW_AT_decl_file   : 6
    <e81>   DW_AT_decl_line   : 451
    <e83>   DW_AT_decl_column : 17
    <e84>   DW_AT_type        : <0xbad>
    <e88>   DW_AT_data_member_location: 72
 <2><e89>: Abbrev Number: 21 (DW_TAG_member)
    <e8a>   DW_AT_name        : (indirect string, offset: 0xf098a): CSAR
    <e8e>   DW_AT_decl_file   : 6
    <e8f>   DW_AT_decl_line   : 452
    <e91>   DW_AT_decl_column : 17
    <e92>   DW_AT_type        : <0xbad>
    <e96>   DW_AT_data_member_location: 76
 <2><e97>: Abbrev Number: 21 (DW_TAG_member)
    <e98>   DW_AT_name        : (indirect string, offset: 0xe7524): CDAR
    <e9c>   DW_AT_decl_file   : 6
    <e9d>   DW_AT_decl_line   : 453
    <e9f>   DW_AT_decl_column : 17
    <ea0>   DW_AT_type        : <0xbad>
    <ea4>   DW_AT_data_member_location: 80
 <2><ea5>: Abbrev Number: 21 (DW_TAG_member)
    <ea6>   DW_AT_name        : (indirect string, offset: 0x10bf20): CTR3
    <eaa>   DW_AT_decl_file   : 6
    <eab>   DW_AT_decl_line   : 454
    <ead>   DW_AT_decl_column : 17
    <eae>   DW_AT_type        : <0xbad>
    <eb2>   DW_AT_data_member_location: 84
 <2><eb3>: Abbrev Number: 21 (DW_TAG_member)
    <eb4>   DW_AT_name        : (indirect string, offset: 0xc0f16): CBR2
    <eb8>   DW_AT_decl_file   : 6
    <eb9>   DW_AT_decl_line   : 455
    <ebb>   DW_AT_decl_column : 17
    <ebc>   DW_AT_type        : <0xbad>
    <ec0>   DW_AT_data_member_location: 88
 <2><ec1>: Abbrev Number: 21 (DW_TAG_member)
    <ec2>   DW_AT_name        : (indirect string, offset: 0x644d5): RESERVED3
    <ec6>   DW_AT_decl_file   : 6
    <ec7>   DW_AT_decl_line   : 456
    <ec9>   DW_AT_decl_column : 17
    <eca>   DW_AT_type        : <0xd2d>
    <ece>   DW_AT_data_member_location: 92
 <2><ecf>: Abbrev Number: 21 (DW_TAG_member)
    <ed0>   DW_AT_name        : (indirect string, offset: 0x149b73): CLLR
    <ed4>   DW_AT_decl_file   : 6
    <ed5>   DW_AT_decl_line   : 457
    <ed7>   DW_AT_decl_column : 17
    <ed8>   DW_AT_type        : <0xbad>
    <edc>   DW_AT_data_member_location: 124
 <2><edd>: Abbrev Number: 0
 <1><ede>: Abbrev Number: 17 (DW_TAG_array_type)
    <edf>   DW_AT_type        : <0xba1>
    <ee3>   DW_AT_sibling     : <0xeee>
 <2><ee7>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <ee8>   DW_AT_type        : <0xb76>
    <eec>   DW_AT_upper_bound : 9
 <2><eed>: Abbrev Number: 0
 <1><eee>: Abbrev Number: 22 (DW_TAG_typedef)
    <eef>   DW_AT_name        : (indirect string, offset: 0x27a34): DMA_Channel_TypeDef
    <ef3>   DW_AT_decl_file   : 6
    <ef4>   DW_AT_decl_line   : 458
    <ef6>   DW_AT_decl_column : 3
    <ef7>   DW_AT_type        : <0xe01>
 <1><efb>: Abbrev Number: 19 (DW_TAG_structure_type)
    <efc>   DW_AT_byte_size   : 52
    <efd>   DW_AT_decl_file   : 6
    <efe>   DW_AT_decl_line   : 588
    <f00>   DW_AT_decl_column : 9
    <f01>   DW_AT_sibling     : <0xfae>
 <2><f05>: Abbrev Number: 21 (DW_TAG_member)
    <f06>   DW_AT_name        : (indirect string, offset: 0x1455fd): MODER
    <f0a>   DW_AT_decl_file   : 6
    <f0b>   DW_AT_decl_line   : 590
    <f0d>   DW_AT_decl_column : 17
    <f0e>   DW_AT_type        : <0xbad>
    <f12>   DW_AT_data_member_location: 0
 <2><f13>: Abbrev Number: 21 (DW_TAG_member)
    <f14>   DW_AT_name        : (indirect string, offset: 0x14516b): OTYPER
    <f18>   DW_AT_decl_file   : 6
    <f19>   DW_AT_decl_line   : 591
    <f1b>   DW_AT_decl_column : 17
    <f1c>   DW_AT_type        : <0xbad>
    <f20>   DW_AT_data_member_location: 4
 <2><f21>: Abbrev Number: 21 (DW_TAG_member)
    <f22>   DW_AT_name        : (indirect string, offset: 0x142fa9): OSPEEDR
    <f26>   DW_AT_decl_file   : 6
    <f27>   DW_AT_decl_line   : 592
    <f29>   DW_AT_decl_column : 17
    <f2a>   DW_AT_type        : <0xbad>
    <f2e>   DW_AT_data_member_location: 8
 <2><f2f>: Abbrev Number: 21 (DW_TAG_member)
    <f30>   DW_AT_name        : (indirect string, offset: 0x1457a2): PUPDR
    <f34>   DW_AT_decl_file   : 6
    <f35>   DW_AT_decl_line   : 593
    <f37>   DW_AT_decl_column : 17
    <f38>   DW_AT_type        : <0xbad>
    <f3c>   DW_AT_data_member_location: 12
 <2><f3d>: Abbrev Number: 20 (DW_TAG_member)
    <f3e>   DW_AT_name        : IDR
    <f42>   DW_AT_decl_file   : 6
    <f43>   DW_AT_decl_line   : 594
    <f45>   DW_AT_decl_column : 17
    <f46>   DW_AT_type        : <0xbad>
    <f4a>   DW_AT_data_member_location: 16
 <2><f4b>: Abbrev Number: 20 (DW_TAG_member)
    <f4c>   DW_AT_name        : ODR
    <f50>   DW_AT_decl_file   : 6
    <f51>   DW_AT_decl_line   : 595
    <f53>   DW_AT_decl_column : 17
    <f54>   DW_AT_type        : <0xbad>
    <f58>   DW_AT_data_member_location: 20
 <2><f59>: Abbrev Number: 21 (DW_TAG_member)
    <f5a>   DW_AT_name        : (indirect string, offset: 0x141e3b): BSRR
    <f5e>   DW_AT_decl_file   : 6
    <f5f>   DW_AT_decl_line   : 596
    <f61>   DW_AT_decl_column : 17
    <f62>   DW_AT_type        : <0xbad>
    <f66>   DW_AT_data_member_location: 24
 <2><f67>: Abbrev Number: 21 (DW_TAG_member)
    <f68>   DW_AT_name        : (indirect string, offset: 0x1485d8): LCKR
    <f6c>   DW_AT_decl_file   : 6
    <f6d>   DW_AT_decl_line   : 597
    <f6f>   DW_AT_decl_column : 17
    <f70>   DW_AT_type        : <0xbad>
    <f74>   DW_AT_data_member_location: 28
 <2><f75>: Abbrev Number: 20 (DW_TAG_member)
    <f76>   DW_AT_name        : AFR
    <f7a>   DW_AT_decl_file   : 6
    <f7b>   DW_AT_decl_line   : 598
    <f7d>   DW_AT_decl_column : 17
    <f7e>   DW_AT_type        : <0xd4d>
    <f82>   DW_AT_data_member_location: 32
 <2><f83>: Abbrev Number: 20 (DW_TAG_member)
    <f84>   DW_AT_name        : BRR
    <f88>   DW_AT_decl_file   : 6
    <f89>   DW_AT_decl_line   : 599
    <f8b>   DW_AT_decl_column : 17
    <f8c>   DW_AT_type        : <0xbad>
    <f90>   DW_AT_data_member_location: 40
 <2><f91>: Abbrev Number: 21 (DW_TAG_member)
    <f92>   DW_AT_name        : (indirect string, offset: 0x144bb7): HSLVR
    <f96>   DW_AT_decl_file   : 6
    <f97>   DW_AT_decl_line   : 600
    <f99>   DW_AT_decl_column : 17
    <f9a>   DW_AT_type        : <0xbad>
    <f9e>   DW_AT_data_member_location: 44
 <2><f9f>: Abbrev Number: 21 (DW_TAG_member)
    <fa0>   DW_AT_name        : (indirect string, offset: 0x142c85): SECCFGR
    <fa4>   DW_AT_decl_file   : 6
    <fa5>   DW_AT_decl_line   : 601
    <fa7>   DW_AT_decl_column : 17
    <fa8>   DW_AT_type        : <0xbad>
    <fac>   DW_AT_data_member_location: 48
 <2><fad>: Abbrev Number: 0
 <1><fae>: Abbrev Number: 22 (DW_TAG_typedef)
    <faf>   DW_AT_name        : (indirect string, offset: 0x14317e): GPIO_TypeDef
    <fb3>   DW_AT_decl_file   : 6
    <fb4>   DW_AT_decl_line   : 602
    <fb6>   DW_AT_decl_column : 3
    <fb7>   DW_AT_type        : <0xefb>
 <1><fbb>: Abbrev Number: 2 (DW_TAG_base_type)
    <fbc>   DW_AT_byte_size   : 8
    <fbd>   DW_AT_encoding    : 4	(float)
    <fbe>   DW_AT_name        : (indirect string, offset: 0xba136): long double
 <1><fc2>: Abbrev Number: 2 (DW_TAG_base_type)
    <fc3>   DW_AT_byte_size   : 1
    <fc4>   DW_AT_encoding    : 8	(unsigned char)
    <fc5>   DW_AT_name        : (indirect string, offset: 0x115948): char
 <1><fc9>: Abbrev Number: 2 (DW_TAG_base_type)
    <fca>   DW_AT_byte_size   : 4
    <fcb>   DW_AT_encoding    : 4	(float)
    <fcc>   DW_AT_name        : (indirect string, offset: 0x10adaa): float
 <1><fd0>: Abbrev Number: 2 (DW_TAG_base_type)
    <fd1>   DW_AT_byte_size   : 8
    <fd2>   DW_AT_encoding    : 4	(float)
    <fd3>   DW_AT_name        : (indirect string, offset: 0xba13b): double
 <1><fd7>: Abbrev Number: 6 (DW_TAG_enumeration_type)
    <fd8>   DW_AT_encoding    : 7	(unsigned)
    <fd9>   DW_AT_byte_size   : 1
    <fda>   DW_AT_type        : <0xb1a>
    <fde>   DW_AT_decl_file   : 7
    <fdf>   DW_AT_decl_line   : 44
    <fe0>   DW_AT_decl_column : 1
    <fe1>   DW_AT_sibling     : <0xffe>
 <2><fe5>: Abbrev Number: 7 (DW_TAG_enumerator)
    <fe6>   DW_AT_name        : (indirect string, offset: 0x10a786): HAL_OK
    <fea>   DW_AT_const_value : 0
 <2><feb>: Abbrev Number: 7 (DW_TAG_enumerator)
    <fec>   DW_AT_name        : (indirect string, offset: 0x3a36a): HAL_ERROR
    <ff0>   DW_AT_const_value : 1
 <2><ff1>: Abbrev Number: 7 (DW_TAG_enumerator)
    <ff2>   DW_AT_name        : (indirect string, offset: 0x16b12): HAL_BUSY
    <ff6>   DW_AT_const_value : 2
 <2><ff7>: Abbrev Number: 7 (DW_TAG_enumerator)
    <ff8>   DW_AT_name        : (indirect string, offset: 0x20cea): HAL_TIMEOUT
    <ffc>   DW_AT_const_value : 3
 <2><ffd>: Abbrev Number: 0
 <1><ffe>: Abbrev Number: 3 (DW_TAG_typedef)
    <fff>   DW_AT_name        : (indirect string, offset: 0x10dcda): HAL_StatusTypeDef
    <1003>   DW_AT_decl_file   : 7
    <1004>   DW_AT_decl_line   : 49
    <1005>   DW_AT_decl_column : 3
    <1006>   DW_AT_type        : <0xfd7>
 <1><100a>: Abbrev Number: 6 (DW_TAG_enumeration_type)
    <100b>   DW_AT_encoding    : 7	(unsigned)
    <100c>   DW_AT_byte_size   : 1
    <100d>   DW_AT_type        : <0xb1a>
    <1011>   DW_AT_decl_file   : 7
    <1012>   DW_AT_decl_line   : 55
    <1013>   DW_AT_decl_column : 1
    <1014>   DW_AT_sibling     : <0x1025>
 <2><1018>: Abbrev Number: 7 (DW_TAG_enumerator)
    <1019>   DW_AT_name        : (indirect string, offset: 0x6f0a7): HAL_UNLOCKED
    <101d>   DW_AT_const_value : 0
 <2><101e>: Abbrev Number: 7 (DW_TAG_enumerator)
    <101f>   DW_AT_name        : (indirect string, offset: 0x109aa0): HAL_LOCKED
    <1023>   DW_AT_const_value : 1
 <2><1024>: Abbrev Number: 0
 <1><1025>: Abbrev Number: 3 (DW_TAG_typedef)
    <1026>   DW_AT_name        : (indirect string, offset: 0x781c4): HAL_LockTypeDef
    <102a>   DW_AT_decl_file   : 7
    <102b>   DW_AT_decl_line   : 58
    <102c>   DW_AT_decl_column : 3
    <102d>   DW_AT_type        : <0x100a>
 <1><1031>: Abbrev Number: 6 (DW_TAG_enumeration_type)
    <1032>   DW_AT_encoding    : 7	(unsigned)
    <1033>   DW_AT_byte_size   : 1
    <1034>   DW_AT_type        : <0xb1a>
    <1038>   DW_AT_decl_file   : 8
    <1039>   DW_AT_decl_line   : 69
    <103a>   DW_AT_decl_column : 1
    <103b>   DW_AT_sibling     : <0x104c>
 <2><103f>: Abbrev Number: 7 (DW_TAG_enumerator)
    <1040>   DW_AT_name        : (indirect string, offset: 0x14513d): GPIO_PIN_RESET
    <1044>   DW_AT_const_value : 0
 <2><1045>: Abbrev Number: 7 (DW_TAG_enumerator)
    <1046>   DW_AT_name        : (indirect string, offset: 0x14327e): GPIO_PIN_SET
    <104a>   DW_AT_const_value : 1
 <2><104b>: Abbrev Number: 0
 <1><104c>: Abbrev Number: 3 (DW_TAG_typedef)
    <104d>   DW_AT_name        : (indirect string, offset: 0x1459d2): GPIO_PinState
    <1051>   DW_AT_decl_file   : 8
    <1052>   DW_AT_decl_line   : 72
    <1053>   DW_AT_decl_column : 3
    <1054>   DW_AT_type        : <0x1031>
 <1><1058>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <1059>   DW_AT_byte_size   : 4
    <105a>   DW_AT_type        : <0xfae>
 <1><105e>: Abbrev Number: 8 (DW_TAG_structure_type)
    <105f>   DW_AT_byte_size   : 52
    <1060>   DW_AT_decl_file   : 9
    <1061>   DW_AT_decl_line   : 49
    <1062>   DW_AT_decl_column : 9
    <1063>   DW_AT_sibling     : <0x1111>
 <2><1067>: Abbrev Number: 9 (DW_TAG_member)
    <1068>   DW_AT_name        : (indirect string, offset: 0xc5518): Request
    <106c>   DW_AT_decl_file   : 9
    <106d>   DW_AT_decl_line   : 51
    <106e>   DW_AT_decl_column : 12
    <106f>   DW_AT_type        : <0xba1>
    <1073>   DW_AT_data_member_location: 0
 <2><1074>: Abbrev Number: 9 (DW_TAG_member)
    <1075>   DW_AT_name        : (indirect string, offset: 0xc5513): BlkHWRequest
    <1079>   DW_AT_decl_file   : 9
    <107a>   DW_AT_decl_line   : 54
    <107b>   DW_AT_decl_column : 12
    <107c>   DW_AT_type        : <0xba1>
    <1080>   DW_AT_data_member_location: 4
 <2><1081>: Abbrev Number: 9 (DW_TAG_member)
    <1082>   DW_AT_name        : (indirect string, offset: 0x14a7e2): Direction
    <1086>   DW_AT_decl_file   : 9
    <1087>   DW_AT_decl_line   : 58
    <1088>   DW_AT_decl_column : 12
    <1089>   DW_AT_type        : <0xba1>
    <108d>   DW_AT_data_member_location: 8
 <2><108e>: Abbrev Number: 9 (DW_TAG_member)
    <108f>   DW_AT_name        : (indirect string, offset: 0x1162b9): SrcInc
    <1093>   DW_AT_decl_file   : 9
    <1094>   DW_AT_decl_line   : 61
    <1095>   DW_AT_decl_column : 12
    <1096>   DW_AT_type        : <0xba1>
    <109a>   DW_AT_data_member_location: 12
 <2><109b>: Abbrev Number: 9 (DW_TAG_member)
    <109c>   DW_AT_name        : (indirect string, offset: 0x1407b1): DestInc
    <10a0>   DW_AT_decl_file   : 9
    <10a1>   DW_AT_decl_line   : 64
    <10a2>   DW_AT_decl_column : 12
    <10a3>   DW_AT_type        : <0xba1>
    <10a7>   DW_AT_data_member_location: 16
 <2><10a8>: Abbrev Number: 9 (DW_TAG_member)
    <10a9>   DW_AT_name        : (indirect string, offset: 0x7d78): SrcDataWidth
    <10ad>   DW_AT_decl_file   : 9
    <10ae>   DW_AT_decl_line   : 67
    <10af>   DW_AT_decl_column : 12
    <10b0>   DW_AT_type        : <0xba1>
    <10b4>   DW_AT_data_member_location: 20
 <2><10b5>: Abbrev Number: 9 (DW_TAG_member)
    <10b6>   DW_AT_name        : (indirect string, offset: 0x8ec53): DestDataWidth
    <10ba>   DW_AT_decl_file   : 9
    <10bb>   DW_AT_decl_line   : 70
    <10bc>   DW_AT_decl_column : 12
    <10bd>   DW_AT_type        : <0xba1>
    <10c1>   DW_AT_data_member_location: 24
 <2><10c2>: Abbrev Number: 9 (DW_TAG_member)
    <10c3>   DW_AT_name        : (indirect string, offset: 0x14892f): Priority
    <10c7>   DW_AT_decl_file   : 9
    <10c8>   DW_AT_decl_line   : 73
    <10c9>   DW_AT_decl_column : 12
    <10ca>   DW_AT_type        : <0xba1>
    <10ce>   DW_AT_data_member_location: 28
 <2><10cf>: Abbrev Number: 9 (DW_TAG_member)
    <10d0>   DW_AT_name        : (indirect string, offset: 0x11908d): SrcBurstLength
    <10d4>   DW_AT_decl_file   : 9
    <10d5>   DW_AT_decl_line   : 76
    <10d6>   DW_AT_decl_column : 12
    <10d7>   DW_AT_type        : <0xba1>
    <10db>   DW_AT_data_member_location: 32
 <2><10dc>: Abbrev Number: 9 (DW_TAG_member)
